[
    {
        "term": "non-parametric (statistics)",
        "meaning": "A branch of statistical tests which do not assume a known distribution of the population which the samples were taken from (Kruskal-Wallis and Dunn test are examples of non-parametric tests)."
    },
    {
        "term": "+1",
        "meaning": "A vote in favor of something."
    },
    {
        "term": "68-95-99.7 rule",
        "meaning": "Expresses the fact that 68% of values lie within one standard deviation of the mean, 95% lie within two, and 99.7% lie within three. Conversely, about 0.3% of values lie more than three standard deviations above or below the mean in most cases."
    },
    {
        "term": "abandonware",
        "meaning": "Software that is no longer being maintained."
    },
    {
        "term": "absolute error",
        "meaning": "The absolute value of the difference between the observed and the correct value. Absolute error is usually less useful than relative error."
    },
    {
        "term": "absolute path",
        "meaning": "A path that points to the same location in the filesystem regardless of where it is evaluated. An absolute path is the equivalent of latitude and longitude in geography."
    },
    {
        "term": "absolute row number",
        "meaning": "The sequential index of a row in a table, regardless of what sections of the table is being displayed."
    },
    {
        "term": "abstract method",
        "meaning": "In object-oriented programming, a method that is defined but not implemented. Programmers will define an abstract method in a parent class to specify operations that child classes must provide."
    },
    {
        "term": "abstract syntax tree (AST)",
        "meaning": "A deeply nested data structure, or tree, that represents the structure of a program. For example, the AST might have a node representing a while loop with one child representing the loop condition and another representing the loop body."
    },
    {
        "term": "accuracy",
        "meaning": "Statistical measure of a classification model which gives the proportion  of correct predictions among total number of cases. It is calculated as  Accuracy = (TP+TN)/(TP+TN+FP+FN)"
    },
    {
        "term": "actual result (of test)",
        "meaning": "The value generated by running code in a test. If this matches the expected result, the test passes; if the two are different, the test fails."
    },
    {
        "term": "affordance",
        "meaning": "A property of something that suggests how it can be used, such as a handle or button."
    },
    {
        "term": "aggregation function",
        "meaning": "A function that combines many values into one, such as sum or max."
    },
    {
        "term": "aggregation",
        "meaning": "To combine many values into one, e.g., by summing a set of numbers or concatenating a set of strings."
    },
    {
        "term": "agile development",
        "meaning": "A software development methodology that emphasizes lots of small steps and continuous feedback instead of up-front planning and long-term scheduling. Exploratory programming is often agile."
    },
    {
        "term": "algorithm",
        "meaning": "An algorithm is a set of steps, intructions, or rules to be followed to accomplish a specific task. In computer science, an algorithm is a set of instructions in a computer program that solves a computational problem."
    },
    {
        "term": "algorithmic bias",
        "meaning": "Repeatable results that show bias, or skewed treatment, found in an algorithm. For example, social media algorithms may prioritize or stigmatize content from certain groups of users."
    },
    {
        "term": "aliasing",
        "meaning": "To have two or more references to the same thing, such as a data structure in memory or a file on disk."
    },
    {
        "term": "Anaconda",
        "meaning": "Anaconda is a [software distribution] (#software_distribution) of R and Python. It is also a [repository] (#repository) of open-source Python and R programs for data science, packaged using the conda [package manager] (#package_manager). Anaconda also creates Anaconda Navigator, a suite of desktop tools including an [IDE] (#ide) and the Jupyter Notebook application."
    },
    {
        "term": "anchor",
        "meaning": "In a regular expression, a symbol that fixes a position without matching characters. ^ matches the start of the line, while $ matches the end of the line and \\b matches a break between word and non-word characters."
    },
    {
        "term": "anonymous function",
        "meaning": "A function that has not been assigned a name. Anonymous functions are usually quite short, and are usually defined where they are used, e.g., as callbacks. In Python, these are called lambda functions and are created through use of the lambda reserved word."
    },
    {
        "term": "anti join",
        "meaning": "A join that keeps rows from table A whose keys do not match keys in table B."
    },
    {
        "term": "append mode",
        "meaning": "To add data to the end of an existing file instead of overwriting the previous contents of that file. Overwriting is the default, so most programming languages require programs to be explicit about wanting to append instead."
    },
    {
        "term": "Application Programming Interface (API)",
        "meaning": "A set of functions and procedures provided by one software library or web service through which another application can communicate with it. An API is not the code, the database, or the server: it’s the access point."
    },
    {
        "term": "argument",
        "meaning": "The term should not be confused with, and is not a synonym for, parameter. An argument is one of possibly several expressions that are passed to a function. It is the actual value that is passed. Parameters and arguments are distinct, but related concepts. Parameters are variables and arguments are the values assigned to those variables."
    },
    {
        "term": "arithmetic mean",
        "meaning": "See mean. Calculated from a set of n numbers by summing those  numbers, and dividing the result by n. See mean."
    },
    {
        "term": "ASCII",
        "meaning": "A standard way to represent the characters commonly used in the Western European languages as 7- or 8-bit integers, now superseded by Unicode."
    },
    {
        "term": "assertion",
        "meaning": "A Boolean expression that must be true at a certain point in a program. Assertions may be built into the language (e.g., Python’s assert statement) or provided as functions (e.g., R’s stopifnot). They are often used in testing, but are also put in production code to check that it is behaving correctly. In many languages, assertions should not be used to perform data validation as they may be silently dropped by compilers and interpreters under optimization conditions. Using assertions for data validation can therefore introduce security risks. Unlike many languages, R does not have an assert statement which can be disabled, and so use of a package such as assertr for data validation does not create security holes."
    },
    {
        "term": "associative array",
        "meaning": "See dictionary."
    },
    {
        "term": "asynchronous",
        "meaning": "Not happening at the same time. In programming, an asynchronous operation is one that runs independently of another, or that starts at one time and ends at another."
    },
    {
        "term": "attribute",
        "meaning": "A name-value pair associated with an object, used to store metadata about the object such as an array’s dimensions."
    },
    {
        "term": "auto-completion",
        "meaning": "A feature that allows the user to finish a word or code quickly by pressing the TAB key to list possible words or code from which the user can select."
    },
    {
        "term": "autocorrelation",
        "meaning": "The degree of similarity between observations in the same series but separated by a time interval  (known as the “lag”). Autocorrelation analysis can be used to gain insight into time series  datasets by detecting repeating patterns that may be partially concealed by random noise, among  other uses."
    },
    {
        "term": "automatic variable",
        "meaning": "A variable that is automatically given a value in a build rule. For example, Make automatically assigns the name of a rule’s target to the automatic variable $@. Automatic variables are frequently used when writing pattern rules."
    },
    {
        "term": "backpropagation",
        "meaning": "An algorithm that iteratively adjusts the weights used in a neural network. Backpropagation is often used to implement gradient descent."
    },
    {
        "term": "backward-compatible",
        "meaning": "A property of a system, hardware or software, that allows for interoperability with an older legacy system, or with input designed for such a system. For example a function written in Python 3 that can be run successfully with Python version 2 is backward-compatible."
    },
    {
        "term": "base R",
        "meaning": "The basic functions making up the R language. The base packages can be found in src/library and are not updated outside of R; their version numbers follow R version numbering. Base packages are installed and loaded with R, while priority packages are installed with base R but must be loaded prior to use."
    },
    {
        "term": "Bayes' Rule",
        "meaning": "See Bayes’ Theorem."
    },
    {
        "term": "Bayes' Theorem",
        "meaning": "An equation for calculating the probability that something is true if something related to it is true. If P(X) is the probability that X is true and P(X"
    },
    {
        "term": "Bayesian network",
        "meaning": "A graph that represents the relationships between random variables for a given problem."
    },
    {
        "term": "bias",
        "meaning": "A statistic is biased if it is systematically or consistently different from the parameter it is supposed to estimate."
    },
    {
        "term": "big data",
        "meaning": "Any data that until recently was too big for most people to work with on a single computer."
    },
    {
        "term": "binary expression",
        "meaning": "An expression which has two parameters and takes two arguments, such as 1 + 2."
    },
    {
        "term": "binary large object (BLOB)",
        "meaning": "Data that is stored in a database without being interpreted in any way, such as an audio file. The term is also now used to refer to data transferred over a network or stored in a version control repository as uninterpreted bits."
    },
    {
        "term": "binary",
        "meaning": "A system which can have one of two possible states. In computing often represented as being in the state 0 or 1. Represented in Boolean logic as false (0) or true (1). Computers are built upon systems which store 0s and 1s as bits."
    },
    {
        "term": "binomial distribution",
        "meaning": "A probability distribution that arises when there are a fixed number of trials, each of which can produce one of two outcomes, and the probability of those outcomes does not change. As the number of trials increases, the binomial distribution approximates a normal distribution."
    },
    {
        "term": "bit",
        "meaning": "A unit of information representing alternatives, yes/no, true/false. In computing a state of either 0 or 1."
    },
    {
        "term": "block comment",
        "meaning": "A comment that spans multiple lines. Block comments may be marked with special start and end symbols, like /* and */ in C and its descendents, or each line may be prefixed with a marker like #."
    },
    {
        "term": "boilerplate",
        "meaning": "Standard text that is included in legal contracts, licenses, and so on. Also parts of the source code that have to be repeated very often to get basic functionality. In object-oriented programs these segments are used to encapsulate variables of objects. Some languages require a lot of these statements and are termed boilerplate languages, e.g. Java, which means that they are frequently generated automatically or by using auto-completion."
    },
    {
        "term": "Boolean",
        "meaning": "Relating to a variable or data type that can have either a logical value of true or false. Named for George Boole, a 19th century mathematician. Binary systems, like all computers, are built on this foundation of systems of logical evaluations between states of true and false, 1 or 0."
    },
    {
        "term": "branch-per-feature workflow",
        "meaning": "A common strategy for managing work with Git and other version control systems in which a separate branch is created for work on each new feature or each bug fix and merged when that work is completed. This isolates changes from one another until they are completed."
    },
    {
        "term": "branch",
        "meaning": "See Git branch."
    },
    {
        "term": "breadcrumbs",
        "meaning": "A set of supplementary navigational links included in many websites, usually placed at the top of the page. Breadcrumbs show the users where the current page lies in the website; the term comes from a fairy tale in which children left a trail of breadcrumbs behind themselves so that they could find their way home."
    },
    {
        "term": "breadth first",
        "meaning": "To go through a nested data structure such as a tree by exploring all of one level, then going on to the next level and so on, or to explore a problem by examining the first step of each possible solution, and then trying the next step for each."
    },
    {
        "term": "browser cache",
        "meaning": "A place where web browsers keep copies of previously retrieved files (web pages, data files) in order to save time when they’re requested again. Sometimes, issues may arise if there is a newer version of the file online, but the browser doesn’t notice it."
    },
    {
        "term": "bug report",
        "meaning": "A collection of files, logs, or related information that describes either an unexpected output of some code or program, or an unexpected error or warning. This information is used to help find and fix a bug in the program or code."
    },
    {
        "term": "bug tracker",
        "meaning": "A system that tracks and manages reported bugs for a software program, to make it easier to address and fix the bugs."
    },
    {
        "term": "bug",
        "meaning": "A missing or undesirable feature of a piece of software; the digital equivalent of a weed."
    },
    {
        "term": "build manager",
        "meaning": "A program that keeps track of how files depend on one another and runs commands to update any files that are out-of-date. Build managers were invented to compile only those parts of programs that had changed, but are now often used to implement workflows in which plots depend on results files, which in turn depend on raw data files or configuration files."
    },
    {
        "term": "build recipe",
        "meaning": "The part of a build rule that describes how to update something that has fallen out-of-date."
    },
    {
        "term": "build rule",
        "meaning": "A specification for a build manager that describes how some files depend on others and what to do if those files are out-of-date."
    },
    {
        "term": "build target",
        "meaning": "The file(s) that a build rule will update if they are out-of-date compared to their dependencies."
    },
    {
        "term": "byte code",
        "meaning": "A set of instructions designed to be executed efficiently by an interpreter."
    },
    {
        "term": "byte",
        "meaning": "A unit of digital information that typically consists of eight binary digits, or bits."
    },
    {
        "term": "cache",
        "meaning": "Something that stores copies of data so that future requests for it can be satisfied more quickly. The CPU in a computer uses a hardware cache to hold recently-accessed values; many programs rely on a software cache to reduce network traffic and latency. Figuring out when something in a cache is out-of-date and should be replaced is one of the two hard problems in computer science."
    },
    {
        "term": "caching",
        "meaning": "To save a copy of some data in a local cache to make future access faster."
    },
    {
        "term": "call stack",
        "meaning": "A data structure that stores information about the active subroutines executed."
    },
    {
        "term": "callback function",
        "meaning": "A function A that is passed to another function B so that B can call it at some later point. Callbacks can be used synchronously, as in generic functions like map that invoke a callback function once for each element in a collection, or asynchronously, as in a client that runs a callback when a response is received in answer to a request."
    },
    {
        "term": "camel case",
        "meaning": "A style of writing code that involves naming variables and objects with no space, underscore (_), dot (.), or dash (-) characters, with each word being capitalized. Examples include CalculateSum and findPattern."
    },
    {
        "term": "Cascading Style Sheets (CSS)",
        "meaning": "A way to control the appearance of HTML. CSS is typically used to specify fonts, colors, and layout."
    },
    {
        "term": "catch (an exception)",
        "meaning": "To accept responsibility for handling an error or other unexpected event. R prefers “handling a condition” to “catching an exception.” Python, on the other hand, encourages raising and catching exceptions, and in some situations, requires it."
    },
    {
        "term": "causation",
        "meaning": "A relationship between distinct events, where it is asserted that one event is responsible for producing or affecting change in the other."
    },
    {
        "term": "CC-0",
        "meaning": "A Creative Commons license that imposes no restrictions whatsover, thereby putting a work in the public domain."
    },
    {
        "term": "CC-BY",
        "meaning": "The Creative Commons - Attribution license that requires people to give credit to the author of a work, but imposes no other restrictions."
    },
    {
        "term": "Central Processing Unit (CPU)",
        "meaning": "The principal hardware of any digital computer. The CPU constitutes the essential electronic circuitry that interprets and executes instructions from the software or other hardware. Also called a central processor, main processor, or microprocessor."
    },
    {
        "term": "centroid",
        "meaning": "The center or anchor of a group created by a clustering algorithm."
    },
    {
        "term": "character encoding",
        "meaning": "A specification of how characters are stored as bytes. The most commonly-used encoding today is UTF-8."
    },
    {
        "term": "chi-square test",
        "meaning": "A statistical method for estimating whether two variables in a cross tabulation are correlated. A chi-square distribution varies from a normal distribution based on the degrees of freedom used to calculate it."
    },
    {
        "term": "child (in a tree)",
        "meaning": "A node in a tree that is below another node (call the parent)."
    },
    {
        "term": "child class",
        "meaning": "In object-oriented programming, a class derived from another class (called the parent class)."
    },
    {
        "term": "class",
        "meaning": "In object-oriented programming, a structure that combines data and operations (called methods). The program then uses a constructor to create an object with those properties and methods. Programmers generally put generic or reusable behavior in parent classes, and more detailed or specific behavior in child classes."
    },
    {
        "term": "classification",
        "meaning": "The process of identifying which predefined category an item belongs to, such as deciding whether an email message is spam or not. Many machine learning algorithms perform classification."
    },
    {
        "term": "client",
        "meaning": "Typically, a program such as a web browser that gets data from a server and displays it to, or interacts with, users. The term is used more generally to refer to any program A that makes requests of another program B. A single program can be both a client and a server."
    },
    {
        "term": "closure",
        "meaning": "A set of variables defined in the same scope whose existence has been preserved after that scope has ended."
    },
    {
        "term": "clustering",
        "meaning": "The process of dividing data into groups when the groups themselves are not known in advance."
    },
    {
        "term": "code coverage (in testing)",
        "meaning": "How much of a library or program is executed when tests run. This is normally reported as a percentage of lines of code: for example, if 40 out of 50 lines in a file are run during testing, those tests have 80% code coverage."
    },
    {
        "term": "code review",
        "meaning": "To check a program or a change to a program by inspecting its source code."
    },
    {
        "term": "coercion",
        "meaning": "See type coercion."
    },
    {
        "term": "cognitive load",
        "meaning": "The amount of working memory needed to accomplish a set of simultaneous tasks."
    },
    {
        "term": "comma-separated values (CSV)",
        "meaning": "A text format for tabular data in which each record is one row and fields are separated by commas. There are many minor variations, particularly around quoting of strings."
    },
    {
        "term": "command history",
        "meaning": "An automatically created list of previously executed commands. Most read-eval-print loops (REPLs), including the Unix shell, record history and allow users to play back recent commands."
    },
    {
        "term": "command-line argument",
        "meaning": "A filename or control flag given to a command-line program when it is run."
    },
    {
        "term": "command-line interface",
        "meaning": "A user interface that relies solely on text for commands and output, typically running in a shell."
    },
    {
        "term": "command",
        "meaning": "An instruction telling a computer program to perform a specific task."
    },
    {
        "term": "comment",
        "meaning": "Text written in a script that is not treated as code to be run, but rather as text that describes what the code is doing. These are usually short notes, often beginning with a # (in many programming languages)."
    },
    {
        "term": "commit message",
        "meaning": "A comment attached to a commit that explains what was done and why."
    },
    {
        "term": "commit",
        "meaning": "As a verb, the act of saving a set of changes to a database or version control repository. As a noun, the changes saved."
    },
    {
        "term": "compile",
        "meaning": "To translate textual source into another form. Programs in compiled languages are translated into machine instructions for a computer to run, and Markdown is usually translated into HTML for display."
    },
    {
        "term": "compiled language",
        "meaning": "Originally, a language such as C or Fortran that is translated into machine instructions for execution. Languages such as Java are also compiled before execution, but into byte code instead of machine instructions, while interpreted languages like Python are compiled to byte code on the fly."
    },
    {
        "term": "compiler",
        "meaning": "An application that translates programs written in some languages into machine instructions or byte code."
    },
    {
        "term": "Comprehensive R Archive Network (CRAN)",
        "meaning": "A public repository of R packages."
    },
    {
        "term": "computational linguistics",
        "meaning": "The study or application of computational methods for parsing or understanding human languages. Early approaches were algorithmic; most modern approaches are statistical."
    },
    {
        "term": "computational notebook",
        "meaning": "A combination of a document format that allows users to mix prose and code in a single file, and an application that executes that code interactively and in place. The Jupyter Notebook and R Markdown files are both examples of computational notebooks."
    },
    {
        "term": "compute shader",
        "meaning": "A general purpose [shader][#shader] program for use in parallel processing. Often used for [machine learning][#machine_learning], simulations, and other fields which benifit from parallel computation."
    },
    {
        "term": "Concatenate (concat)",
        "meaning": "Append/stack either columns (axis=1) or rows (axis=0) by end-to-end joining of data. Python."
    },
    {
        "term": "conda",
        "meaning": "A [package manager] (#package_manager) and environment management system, particularly popular for Python programs."
    },
    {
        "term": "condition",
        "meaning": "An error or other unexpected event that disrupts the normal flow of control."
    },
    {
        "term": "conditional expression",
        "meaning": "A ternary expression that serves the role of an if/else statement. For example, C and similar languages use the syntax test : ifTrue ? ifFalse to mean “choose the value ifTrue if test is true, or the value ifFalse if it is not.”"
    },
    {
        "term": "confidence interval",
        "meaning": "A range around an estimate that indicates the margin of error, combined with a probability that the actual value falls in that range."
    },
    {
        "term": "configuration file",
        "meaning": "A file that specifies the parameters and initial settings of a software program. Configuration, or config, files are often used for information subject to changes, such as environment-specific settings."
    },
    {
        "term": "confusion matrix",
        "meaning": "A NxN matrix that describes the performance of a classification model, where N is the number  of classes or outputs. Each row in the matrix represents the instances of actual classes and each column  represents the predicted classes. For a binary classification model the confusion matrix  gives the True Positives (TP), False Negatives (FN), False Positives (FP) and True Negatives  (TN) in the 1st, 2nd, 3rd and 4th quadrants, respectively. The table can be used to calculate  Accuracy, Sensitivity and Specificity amongst other measures of the model"
    },
    {
        "term": "console",
        "meaning": "A computer terminal where a user may enter commands, or a program, such as a shell that simulates such a device."
    },
    {
        "term": "constant",
        "meaning": "A value that cannot be changed after it has been defined, as opposed  to a variable."
    },
    {
        "term": "constructor",
        "meaning": "A function that creates an object of a particular class. In the S3 object system, constructors are a convention rather than a requirement."
    },
    {
        "term": "continuation prompt",
        "meaning": "A prompt that indicates that the command currently being typed is not yet complete, and will not be run until it is."
    },
    {
        "term": "continuous integration",
        "meaning": "A software development practice in which changes are automatically merged as soon as they become available"
    },
    {
        "term": "continuous random variable",
        "meaning": "A variable whose value can be any real value, either within a range, or unbounded, such as age or distance."
    },
    {
        "term": "control flow",
        "meaning": "The logical flow through a program’s code. May be linear (i.e. just a series of commands), but may also include loops or conditional execution (i.e. if a condition is met)"
    },
    {
        "term": "copy-on-modify",
        "meaning": "The practice of creating a new copy of aliased data whenever there is an attempt to modify it so that each reference will believe theirs is the only one."
    },
    {
        "term": "correlation coefficient",
        "meaning": "A measure of how well-correlated two variables are. If the correlation coefficient between X and Y is 1.0, knowing X allows perfect prediction of Y. If the correlation coefficient is 0.0, knowing X tells you nothing about Y, and if it is -1.0, then X predicts Y, but a change in X causes an opposite change in Y."
    },
    {
        "term": "correlation",
        "meaning": "A measure of how well two variables agree with each other. Correlation is usually measured by calculating a correlation coefficient, and does not imply causation."
    },
    {
        "term": "covariance",
        "meaning": "How well two variables agree with each other. The correlation coefficient is a normalized measure of covariance."
    },
    {
        "term": "Creative Commons license",
        "meaning": "A set of licenses that can be applied to published work. Each license is formed by concatenating one or more of -BY (Attribution): users must cite the original source; -SA (ShareAlike): users must share their own work under a similar license; -NC (NonCommercial): work may not be used for commercial purposes without the creator’s permission; -ND (NoDerivatives): no derivative works (e.g., translations) can be created without the creator’s permission. Thus, CC-BY-NC means “users must give attribution and cannot use commercially without permission.” The term CC-0 (zero, not letter ‘O’) is sometimes used to mean “no restrictions,” i.e., the work is in the public domain."
    },
    {
        "term": "cross join",
        "meaning": "A join that produces all possible combinations of rows from two tables."
    },
    {
        "term": "cross-validation",
        "meaning": "A technique that divides data into training data and test data. The training data and correct answers are used to find parameters, and the algorithm’s effectiveness is then measured by examining the answers it gives on the test data."
    },
    {
        "term": "cryptographic hash function",
        "meaning": "A hash function that produces an apparently-random value for any input."
    },
    {
        "term": "current working directory",
        "meaning": "The folder or directory location in which the program operates. Any action taken by the program occurs relative to this directory."
    },
    {
        "term": "data collison",
        "meaning": "Occurs when  when two or more devices or nodes try to transmit signals at the same time on the same network. Similarly a data collision can also occur when hashing  if two distinct pieces of data have the same hash value"
    },
    {
        "term": "data engineer",
        "meaning": "Someone who sets up and runs data analyses. Data engineers are often responsible for installing software, managing databases, generating reports, and archiving results."
    },
    {
        "term": "data engineering",
        "meaning": "The pragmatic steps taken to make data usable, such as writing short programs to put mailing addresses in a uniform format."
    },
    {
        "term": "data frame",
        "meaning": "A two-dimensional data structure for storing tabular data in memory. Rows represent records and columns represent variables."
    },
    {
        "term": "data masking",
        "meaning": "Altering data in a dataset to anonymize or otherwise remove identifying information. For example, real names might be swapped out with fictional names to provide name-based data without referencing actual people."
    },
    {
        "term": "data mining",
        "meaning": "The use of computers to search for patterns in large datasets. The term data science is now more commonly used."
    },
    {
        "term": "data package",
        "meaning": "A software package that, mostly, contains only data. Is used to make it simpler to disseminate data for easier use."
    },
    {
        "term": "data science",
        "meaning": "The combination of statistics, programming, and hard work used to extract knowledge from data."
    },
    {
        "term": "data scientist",
        "meaning": "Someone who uses programming skills to solve statistical problems."
    },
    {
        "term": "data structure",
        "meaning": "A format for the organisation, management, and efficient access of data. Typically it will characterise a set of data values and their representation (or encoding), the relationships between values, and ways to access or manipulate those data, such as reading, altering, or writing."
    },
    {
        "term": "data visualization",
        "meaning": "The creation of charts, maps, graphs, or infographics to translate datasets into something visual. Sometimes called “dataviz” or “data viz.”"
    },
    {
        "term": "data wrangling",
        "meaning": "A colloquial name for small-scale data engineering."
    },
    {
        "term": "debug",
        "meaning": "In a computer environment ‘debug’ refers to the process of finding and resolving errors (also known as ‘bugs’) within computer programs or systems."
    },
    {
        "term": "decision tree",
        "meaning": "A tree whose nodes are questions and whose branches eventually lead to a decision or classification."
    },
    {
        "term": "Decorator pattern",
        "meaning": "A design pattern in which a function adds additional features to another function or a class after its initial definition. Decorators are a feature of Python and can be implemented in most other languages as well."
    },
    {
        "term": "decrement",
        "meaning": "A unary operation that decreases the value of a variable, usually by 1."
    },
    {
        "term": "deep learning",
        "meaning": "A family of neural network algorithms that use multiple layers to extract features at successively higher levels."
    },
    {
        "term": "default target",
        "meaning": "The build target that is used when none is specified explicitly."
    },
    {
        "term": "default value",
        "meaning": "A value assigned to a function parameter when the caller does not specify a value. Default values are specified as part of the function’s definition."
    },
    {
        "term": "defensive programming",
        "meaning": "A set of programming practices that assumes mistakes will happen and either reports or corrects them, such as inserting assertions to report situations that are not ever supposed to occur."
    },
    {
        "term": "degrees of freedom",
        "meaning": "In statistics, the degrees of freedom (often “DF”) is a measure of how much independent information, in the form data and calculations, has been combined to produce a given statistical parameter. Put another way, the DF is the number of values that are free to vary in the calculation of a given statistical parameter. For a statistic calculated from data which are indepdendent (i.e., the values are uncorrelated), the DF can be generally estimated as the sample size minus the number of individual parameters calculated to obtain the final statistic"
    },
    {
        "term": "Delegate pattern",
        "meaning": "A design pattern in which an object does most of the work to complete a task, but uses one of a set of other objects to complete some specific parts of the work. Delegation is often used instead of inheritance to customize objects’ behavior."
    },
    {
        "term": "dependency",
        "meaning": "See prerequisite."
    },
    {
        "term": "dependent variable",
        "meaning": "A variable whose value depends on the value of another variable, which is called the independent variable."
    },
    {
        "term": "depth first",
        "meaning": "To go through a nested data structure such as a tree by going as far as possible down one path, then as far as possible down the next and so on, or to explore a problem by following one solution to its conclusion and then trying the next."
    },
    {
        "term": "design pattern",
        "meaning": "A recurring pattern in software design that is specific enough to be worth naming, but not so specific that a single best implementation can be provided by a library. For example, data frames and database tables are instances of the same pattern."
    },
    {
        "term": "destructuring assignment",
        "meaning": "Unpacking values from data structures and assigning them to multiple variables in a single statement."
    },
    {
        "term": "dictionary",
        "meaning": "A data structure that allows items to be looked up by value, sometimes called an associative array. Dictionaries are often implemented using hash tables."
    },
    {
        "term": "Digital Object Identifier (DOI)",
        "meaning": "A unique persistent identifier for a book, paper, report, dataset, software release, or other digital artefact."
    },
    {
        "term": "dimension reduction",
        "meaning": "Reducing the number of dimensions in a dataset, typically by finding the dimensions along which it varies most."
    },
    {
        "term": "directory",
        "meaning": "An item within a filesystem that can contain files and other directories. Also known as a folder."
    },
    {
        "term": "discrete random variable",
        "meaning": "A variable whose value can take on only one of a fixed set of values, such as true or false."
    },
    {
        "term": "distro",
        "meaning": "See software distribution."
    },
    {
        "term": "docstring",
        "meaning": "Short for “documentation string,” a string appearing at the start of a module, class, or function in Python that automatically becomes that object’s documentation."
    },
    {
        "term": "Document Object Model (DOM)",
        "meaning": "A standard, in-memory representation of HTML and XML. Each element is stored as a node in a tree with a set of named attributes; contained elements are child nodes. Modern programming languages provide many libraries for searching and modifying the DOM."
    },
    {
        "term": "documentation generator",
        "meaning": "A software tool that extracts specially formatted comments or dostrings from code and generates cross-referenced developer documentation."
    },
    {
        "term": "DOM selector",
        "meaning": "A pattern that identifies nodes in a DOM tree. For example, #alpha matches nodes whose id attribute is “alpha”, while .beta matches nodes whose class attribute is “beta”."
    },
    {
        "term": "domain knowledge",
        "meaning": "Understanding of a specific problem domain, e.g., knowledge of transportation logistics."
    },
    {
        "term": "Don't Repeat Yourself principle (DRY)",
        "meaning": "The Don’t Repeat Yourself (DRY) principle states that — Every piece of knowledge must have a single, unambiguous, authoritative representation within a system. The term comes from The Pragmatic Programmer, by Andrew Hunt and David Thomas. Programs that follow the DRY Principle avoid duplication of definitions and logic, so that a change in their behaviour only requires each modification to be made in one part of the code. The goal is to create code that is easier to maintain."
    },
    {
        "term": "double square brackets",
        "meaning": "An index enclosed in [[...]], used to return a single value of the underlying type."
    },
    {
        "term": "double",
        "meaning": "Short for “double-precision floating-point number”, meaning a 64-bit numeric value with a fractional part and an exponent."
    },
    {
        "term": "down-vote",
        "meaning": "A vote against something."
    },
    {
        "term": "dynamic loading",
        "meaning": "To import a module into the memory of a program while it is already running. Most interpreted languages use dynamic loading, and provide tools so that programs can find and load modules dynamically to configure themselves."
    },
    {
        "term": "dynamic lookup",
        "meaning": "To find a function or a property of an object by name while a program is running. For example, instead of getting a specific property of an object using obj.name, a program might use obj[someVariable], where someVariable could hold \"name\" or some other property name."
    },
    {
        "term": "dynamic scoping",
        "meaning": "To find the value of a variable by looking at what is on the call stack at the moment the lookup is done. Almost all programming languages use lexical_scoping instead, since it is more predictable."
    },
    {
        "term": "edge",
        "meaning": "A connection between two nodes in a graph. An edge may have data associated with it, such as a name or distance."
    },
    {
        "term": "Electronic mail (email)",
        "meaning": "Electronic mail is a method for delivering messages between people over a computer network. Messages are sent via an SMTP server and retrieved using either an IMAP or POP server"
    },
    {
        "term": "element",
        "meaning": "A named component in an HTML or XML document. Elements are usually written <name>…</name>, where “…” represents the content of the element. Elements often have attributes."
    },
    {
        "term": "Emacs (editor)",
        "meaning": "A text editor that is popular among Unix programmers"
    },
    {
        "term": "empty element",
        "meaning": "An element of an HTML or XML document that has no children. Empty elements can always be written as <name></name>, but may also be written using the shorthand notation <name/> (with a slash after the name inside the angle brackets)."
    },
    {
        "term": "empty vector",
        "meaning": "A vector that contains no elements. Empty vectors have a type such as logical or character, and are not the same as null."
    },
    {
        "term": "encoding",
        "meaning": "The process of putting a sequence of characters such as letters, numbers, punctuation,  and certain symbols, into a specialized format for efficient transmission or storage"
    },
    {
        "term": "environment",
        "meaning": "A structure that stores a set of variable names and the values they refer to."
    },
    {
        "term": "error (in a test)",
        "meaning": "Signalled when something goes wrong in a unit test itself rather than in the system being tested. In this case, we do not know anything about the correctness of the system."
    },
    {
        "term": "error handling",
        "meaning": "What a program does to detect and correct for errors. Examples include printing a message and using a default configuration if the user-specified configuration cannot be found."
    },
    {
        "term": "escape sequence",
        "meaning": "A sequence of characters added as a prefix to some other character that would otherwise have a special meaning, temporarily altering the meaning of the character. For example, the escape sequence \\\" is used to represent a double-quote character inside a double-quoted string."
    },
    {
        "term": "evaluation",
        "meaning": "The process of taking an expression such as 1+2*3/4 and turning it into a single, irreducible value."
    },
    {
        "term": "exception handler",
        "meaning": "A piece of code that deals with an exception after it is caught, e.g., by writing a log message, retrying the operation that failed, or performing an alternate operation."
    },
    {
        "term": "exception",
        "meaning": "An object that stores information about an error or other unusual event in a program. One part of a program will create and raise an exception to signal that something unexpected has happened; another part will catch it."
    },
    {
        "term": "expected result (of test)",
        "meaning": "The value that a piece of software is supposed to produce when tested in a certain way, or the state in which it is supposed to leave the system."
    },
    {
        "term": "exploratory programming",
        "meaning": "A software development methodology in which requirements emerge or change as the software is being written, often in response to results from early runs."
    },
    {
        "term": "export",
        "meaning": "To make something visible outside a module so that other parts of a program can import it. In most languages a module must export things explicitly in an attempt to avoid name collision."
    },
    {
        "term": "fail (a test)",
        "meaning": "A test fails if the actual result does not match the expected result."
    },
    {
        "term": "false negative",
        "meaning": "Data points which are actually true but incorrectly predicted as false."
    },
    {
        "term": "false positive",
        "meaning": "Data points which are actually false but incorrectly predicted as true."
    },
    {
        "term": "false",
        "meaning": "The logical (Boolean) state opposite of “true”. Used in logic and programming to represent a binary state of something."
    },
    {
        "term": "falsy",
        "meaning": "Evaluating to false in a Boolean context."
    },
    {
        "term": "FASTA",
        "meaning": "A file format for storing amino acid or genomic sequence information.  Information for each sequence is broken up into a block of 2 lines. Line 1 contains  information about the sequence and begins with a greater than symbol, ‘>’. Line 2  contains the actual amino acid or genomic sequence using single-letter codes."
    },
    {
        "term": "FASTQ",
        "meaning": "A file format for storing genomic sequence information and the corresponding quality scores.  Information for each sequence is broken up into a block of four lines. Line 1 contains information about the sequence and begins with ‘@’. Line 2 contains the actual genomic sequence using single-letter codes to  represent nucleotides. Line 3 is a separator that begins with a +. Line 4 has a string of  quality characters for each base in the genomic sequence."
    },
    {
        "term": "feature (in data)",
        "meaning": "A variable or observable in a dataset."
    },
    {
        "term": "feature (in software)",
        "meaning": "Some aspect of software that was deliberately designed or built. A bug is an undesired feature."
    },
    {
        "term": "feature branch",
        "meaning": "A branch within a Git repository containing commits dedicated to a specific feature, e.g., a bug fix or a new function. This branch can be merged into another branch."
    },
    {
        "term": "feature engineering",
        "meaning": "The process of choosing the variables to be used as inputs to a model. Choosing good features often depends on domain knowledge."
    },
    {
        "term": "feature request",
        "meaning": "A request to the maintainers or developers of a software program to add a specific functionality (a feature) to that program."
    },
    {
        "term": "Feature",
        "meaning": "An individual characteristic or property of a phenomenon that is measurable  (e.g. length, height, number of petals) and used as the input to a model.   Finding or selecting features that are highly independent and discriminatory  is a fundamental part of classification."
    },
    {
        "term": "field",
        "meaning": "A component of a record containing a single value. Every record in a tibble or database table has the same fields."
    },
    {
        "term": "filename extension",
        "meaning": "The last part of a filename, usually following the ‘.’ symbol. Filename extensions are commonly used to indicate the type of content in the file, though there is no guarantee that this is correct."
    },
    {
        "term": "filename stem",
        "meaning": "The part of the filename that does not include the extension. For example, the stem of glossary.yml is glossary."
    },
    {
        "term": "filesystem",
        "meaning": "The part of the operating system that manages how files are stored and retrieved. Also used to refer to all of those files and directories or the specific way they are stored (as in “the Unix filesystem”)."
    },
    {
        "term": "filter",
        "meaning": "As a verb, to choose a set of records (i.e., rows of a table) based on the values they contain. As a noun, a command-line program that reads lines of text from files or standard input, performs some operation on them (such as filtering), and writes to a file or stdout."
    },
    {
        "term": "fixture",
        "meaning": "The thing on which a test is run, such as the parameters to the function being tested or the file being processed."
    },
    {
        "term": "folder",
        "meaning": "Another term for a directory."
    },
    {
        "term": "for loop",
        "meaning": "A construct in a program that repeats one or more other statements (the loop body) once for each item in a sequence, such as each number in a range or each element of a list."
    },
    {
        "term": "fork",
        "meaning": "A copy of one person’s Git repository that lives in another person’s GitHub account. Changes to the content of a fork can be submitted to the upstream repository via a pull request."
    },
    {
        "term": "fragment shader",
        "meaning": "The [shader][#shader] stage in the rendering pipeline designated towards calculating colours for each fragment on the screen. For each pixel covered by a primitive, a fragment is generated. All fragments for each pixel will have their colours combined based on depth and opacity after the fragment shader stage is complete."
    },
    {
        "term": "Frequently Asked Questions (FAQ)",
        "meaning": "A curated list of questions commonly asked about a subject, along with answers."
    },
    {
        "term": "full identifier (of a commit)",
        "meaning": "A unique 160-bit identifier for a commit in a Git repository, usually written as a 20-character hexadecimal character string."
    },
    {
        "term": "full join",
        "meaning": "A join that returns all rows and all columns from two tables A and B. Where the keys of A and B match, values are combined; where they do not, missing values from either table are filled with null, NA, or some other missing value signifier."
    },
    {
        "term": "fully-qualified name",
        "meaning": "An unambiguous name of the form package::thing, indicating the original source of the object in question."
    },
    {
        "term": "function",
        "meaning": "A code block which gathers a sequence of operations into a whole, preserving it for ongoing use by defining a set of tasks that takes zero or more required and optional arguments as inputs and returns expected outputs (return values), if any. Functions enable repeating these defined tasks with one command, known as a function call."
    },
    {
        "term": "functional programming",
        "meaning": "A style of programming in which data is transformed through successive application of functions, rather than by using control structures such as loops. In functional programming, there must be a direct relationship between the input to a function and the output produced by the function, meaning the result should not be affected by the current values of global variables or other parts of the global program state. It also requires that functions do not produce side effects, meaning they do not modify the global program state, or do anything other than computing the return value, such as writing output to a log file, or printing to the console."
    },
    {
        "term": "garbage in, garbage out (GIGO)",
        "meaning": "The idea that messy data as an input will result in messy data as an output."
    },
    {
        "term": "generator function",
        "meaning": "A function whose state is automatically saved when it returns a value so that execution can be restarted from that point the next time it is called. One example of generator functions use is to produce streams of values that can be processed by for loops."
    },
    {
        "term": "generic function",
        "meaning": "A collection of functions with similar purpose, each operating on a different class of data."
    },
    {
        "term": "Geometric Mean",
        "meaning": "Calculated from a set of n numbers by first computing the product of those numbers, and then computing the n-th root of the result. In  contrast to the arithmetic mean, which measures  central tendancy in an “additive” way, the geometric mean measures central tendancy in a “multiplicative” way, and hence is often appropriate when  estimating an average rates of change or some other multiplicative  constant."
    },
    {
        "term": "geometry shader",
        "meaning": "The [shader][#shader] stage in the rendering pipeline designated towards processing primitives. Not to be confused with [tessellation shaders][#tessellation_shader], geometry shaders are focused on modifying the shape of primitives to create new results. For example, pixels may be converted into particles using a geometry shader."
    },
    {
        "term": "ggplot2",
        "meaning": "A package in R that implements a layered grammar of graphics for generating plots. It is a popular alternative to plotting with base R and part of the tidyverse"
    },
    {
        "term": "Git branch",
        "meaning": "A snapshot of a version of a Git repository. Multiple branches can capture multiple versions of the same repository."
    },
    {
        "term": "Git clone",
        "meaning": "Copies (and usually downloads) of a Git remote repository on a local computer."
    },
    {
        "term": "Git conflict",
        "meaning": "A situation in which incompatible or overlapping changes have been made on different branches that are now being merged."
    },
    {
        "term": "Git fork",
        "meaning": "To make a new copy of a Git repository on a server, or the copy that is made."
    },
    {
        "term": "Git merge",
        "meaning": "Merging branches in Git incorporates development histories of two branches in one. If changes are made to similar parts of the branches on both branches, a conflict will occur and this must be resolved before the merge will be completed."
    },
    {
        "term": "Git pull",
        "meaning": "Downloads and synchronizes changes between a remote repository and a local repository."
    },
    {
        "term": "Git push",
        "meaning": "Uploads and synchronizes changes between a local repository and a remote repository."
    },
    {
        "term": "Git remote",
        "meaning": "A short name for a remote repository (like a bookmark)."
    },
    {
        "term": "Git",
        "meaning": "A version control tool to record and manage changes to a project."
    },
    {
        "term": "GitHub",
        "meaning": "A cloud-based platform built around Git that allows you to save versions of your project online and collaborate with other Git users."
    },
    {
        "term": "global environment",
        "meaning": "The environment that holds top-level definitions in a programming language, e.g., those written directly in the interpreter."
    },
    {
        "term": "global installation",
        "meaning": "Installing a package in a location where it can be accessed by all users and projects."
    },
    {
        "term": "global variable",
        "meaning": "A variable defined outside any particular function or package namespace, which is therefore visible to all functions."
    },
    {
        "term": "globbing",
        "meaning": "To specify a set of filenames using a simplified form of regular expressions, such as *.dat to mean “all files whose names end in .dat”. The name is derived from “global”."
    },
    {
        "term": "GNU Operating System (GNU)",
        "meaning": "“GNU” is an operating system that is free software. GNU is a recursive acronym for “GNU is Not Unix!”. The GNU operating system consists of GNU packages as well as free software realeased by third parties."
    },
    {
        "term": "GNU Public License (GPL)",
        "meaning": "A license that allows people to re-use software as long as they distribute the source of their changes."
    },
    {
        "term": "gradient boosting",
        "meaning": "A machine learning technique that produces an ensemble of weak prediction models (typically decision trees) in a stepwise fashion."
    },
    {
        "term": "gradient descent",
        "meaning": "An optimization algorithm that repeatedly calculates the gradient at the current point takes a small step in the direction in which the gradient is decreasing, and then recalculates the gradient."
    },
    {
        "term": "graph",
        "meaning": "A plot or a chart that displays data, or 2. a data structure in which nodes are connected to one another by edges."
    },
    {
        "term": "graphical user interface (GUI)",
        "meaning": "A user interface that relies on windows, menus, pointers, and other graphical elements, as opposed to a command-line interface or voice-driven interface."
    },
    {
        "term": "Graphics Processing Unit (GPU)",
        "meaning": "Specialized processor designed to run many instances of a single program in parallel. Orginally designed for use in graphics, but is also used for general computation in the form of [compute shaders][#compute_shader]."
    },
    {
        "term": "group",
        "meaning": "To divide data into subsets according to a set of criteria while leaving records in a single structure."
    },
    {
        "term": "handle (condition)",
        "meaning": "To accept responsibility for handling an error or other unexpected event. R prefers “handling a condition” to “catching an exception”. Python, on the other hand, encourages raising and catching exceptions, and in some situations, requires it."
    },
    {
        "term": "hardware (HW)",
        "meaning": "Any physical component of a computer system. Hardware can be internal, such as CPU, memory, and graphics cards; or external, such as monitors and keyboards. Hardware operates in conjunction with software to produce a functioning computer system."
    },
    {
        "term": "Harmonic Mean",
        "meaning": "Calculated from a set of n numbers by first computing the sum of the  reciprocals of those numbers, and then dividing n by the  resulting sum. Alternatively, it can be computed as the  reciprocal of the arithmetic mean of  the reciprocal values. Similarly to the  geometric mean, the harmonic mean is often used as an  alternative measure of central tendancy to the usual  arithmetic mean when estimating an average rates of  change or some other multiplicative constant. For a set of positive  numbers that are not all equal, the min < HM < GM < AM < max where min is  the minimum value, max is the maximum value, and HM GM and AM are the  harmonic, geometric, and arithmetic means respectively."
    },
    {
        "term": "hash function",
        "meaning": "A function that turns arbitrary data into a bit array, or a key, of a fixed size. Hash functions are used to determine where data should be stored in a hash table."
    },
    {
        "term": "hash table",
        "meaning": "A data structure that calculates a pseudo-random key (location) for each value passed to it and stores the value in that location. Hash tables enable fast lookup for arbitrary data. This occurs at the cost of extra memory because hash tables must always be larger than the amount of information they need to store, to avoid the possibility of data collisions, when the hash function returns the same key for two different values."
    },
    {
        "term": "header row",
        "meaning": "If present, the first row of a data file that defines column names (but not their data types or units)."
    },
    {
        "term": "heterogeneous",
        "meaning": "Containing mixed data types. For example, in Python and R, a list can contain a mix of numbers, character strings, and values of other types."
    },
    {
        "term": "hexadecimal",
        "meaning": "A base-16 number system. Hexadecimal values are usually written using the digits 0-9 and the characters A-F in either upper or lower case. Hexadecimal is often used to represent binary values, since two hexadecimal digits use exactly one byte of storage."
    },
    {
        "term": "high performance computing (HPC)",
        "meaning": "When computing power is drawn from multiple powerful processors that work together in parallel, rather than from a single desktop computer, laptop, or work station. This significantly speeds up analysis and reduces computing time, which allows people to work with big data"
    },
    {
        "term": "higher-order function",
        "meaning": "A function that operates on other functions. For example, the higher-order function map executes a given function once on each value in a list. Higher-order functions are heavily used in functional programming."
    },
    {
        "term": "Hippocratic License",
        "meaning": "An ethical software license that allows free use for any purpose that does not contravene the Universal Declaration of Human Rights."
    },
    {
        "term": "histogram",
        "meaning": "A graphical representation of the distribution of a set of numeric data, usually a vertical bar graph."
    },
    {
        "term": "hitchhiker",
        "meaning": "Someone who is part of a project but does not actually do any work on it."
    },
    {
        "term": "home directory",
        "meaning": "A directory that contains a user’s files. Each user on a multi-user computer will have their own home directory; a personal computer will often only have one home directory."
    },
    {
        "term": "homogeneous",
        "meaning": "Containing a single data type. For example, a vector must be homogeneous: its values must all be numeric, logical, etc."
    },
    {
        "term": "HTTP header",
        "meaning": "A key-value pair at the top of an HTTP request or response that carries additional information such as the user’s preferred language or the length of the data being transferred."
    },
    {
        "term": "HTTP request",
        "meaning": "A message sent from a client to a server using the HTTP protocol asking for data. A request usually asks for a web page, image, or other data."
    },
    {
        "term": "HTTP response",
        "meaning": "A reply sent from a server to a client using the HTTP protocol in response to a request. The response usually contains a web page, image, or data."
    },
    {
        "term": "HyperText Markup Language (HTML)",
        "meaning": "The standard markup language used for web pages. HTML is represented in memory using DOM (Digital Object Model)."
    },
    {
        "term": "HyperText Transfer Protocol (HTTP)",
        "meaning": "The standard protocol for data transfer on the World-Wide Web. HTTP defines the format of requests and responses, the meanings of standard error codes, and other features."
    },
    {
        "term": "immutable type",
        "meaning": "Immutable is when no change is possible over time. An object of this type can not be changed and its state can not be modified after it is created"
    },
    {
        "term": "import",
        "meaning": "To bring things from a module into a program for use. In most languages a program can only import things that the module explicitly exports."
    },
    {
        "term": "impostor syndrome",
        "meaning": "The false belief that one’s successes are a result of accident or luck rather than ability."
    },
    {
        "term": "in-place operator",
        "meaning": "An operator that updates one of its operands. For example, the expression x += 2 uses the in-place operator += to add 2 to the current value of x and assign the result back to x."
    },
    {
        "term": "increment",
        "meaning": "A unary operation that increases the value of a variable, usually by 1."
    },
    {
        "term": "independent variable",
        "meaning": "The factor that you purposely change or control in order to see what effect  it has on the dependent variable."
    },
    {
        "term": "infinite loop",
        "meaning": "A loop where the exit condition is never met, so the loop continues to repeat itself. Often a programming error."
    },
    {
        "term": "inner join",
        "meaning": "A join that returns the combination of rows from two tables, A and B, whose keys exist in both tables."
    },
    {
        "term": "instance",
        "meaning": "An object of a particular class."
    },
    {
        "term": "Integrated Development Environment (IDE)",
        "meaning": "An application that helps programmers develop software. IDEs typically have a built-in editor, a console to execute code immediately, and browsers for exploring data structures in memory and files on disk."
    },
    {
        "term": "integration test",
        "meaning": "A test that checks whether the parts of a system work properly when put together."
    },
    {
        "term": "interface",
        "meaning": "A ubiquitously used phrase in computing that describes a point of contact. This could be a user interface (e.g. graphical user interface or command line), the  interface of an object with the rest of the code or how a  program can interact with web services through an API"
    },
    {
        "term": "Internet Message Access Protocol (IMAP)",
        "meaning": "A standard internet protocol used by email clients to retrieve messages from an email server. Messages are left on the server so that they can be accessed from multiple email clients."
    },
    {
        "term": "interpreted language",
        "meaning": "A high-level language that is not executed directly by the computer, but instead is run by an interpreter that translates program instructions into machine commands on the fly."
    },
    {
        "term": "interpreter",
        "meaning": "A program whose job it is to run programs written in a high-level interpreted language. Interpreters can run interactively, but may also execute commands saved in a file."
    },
    {
        "term": "invariant",
        "meaning": "Something that must be true at all times inside of a program or during the lifecycle of an object. Invariants are often expressed using assertions. If an invariant expression is not true, this is indicative of a problem, and may result in failure or early termination of the program"
    },
    {
        "term": "IPython",
        "meaning": "Short for “Interactive Python”, it is a console designed to assist interactive and exploratory programming with features such as coloured text, tab-completion, filesystem navigation, quick access to documentation and shell commands."
    },
    {
        "term": "ISO date format",
        "meaning": "An international for formatting dates. While the full standard is complex, the most common form is YYYY-MM-DD, i.e., a four-digit year, a two-digit month, and a two-digit day, separated by hyphens."
    },
    {
        "term": "issue tracking system",
        "meaning": "Similar to a bug tracking system in that it tracks issues made to a repository, usually in the form of feature requests, bug reports, or some other to-do item."
    },
    {
        "term": "issue",
        "meaning": "A bug report, feature request, or other to-do item associated with a project. Also called a ticket."
    },
    {
        "term": "Iterator pattern",
        "meaning": "A design pattern in which a temporary object or generator function produces each value from a collection in turn for processing. This pattern hides the differences between different kinds of data structures so that everything can be processed using loops."
    },
    {
        "term": "JavaScript Object Notation (JSON)",
        "meaning": "A way to represent data by combining basic values like numbers and character strings in lists and key/value structures. The acronym stands for “JavaScript Object Notation”; unlike better-defined standards like XML, it is unencumbered by a syntax for comments or ways to define a schema."
    },
    {
        "term": "join",
        "meaning": "One of several operations that combine values from two tables."
    },
    {
        "term": "Jupyter Notebook",
        "meaning": "The Jupyter Notebook is an open-source, web-based computational notebook that allows the user to write and share live code, equations, visualisations, and narrative text."
    },
    {
        "term": "Jupyter",
        "meaning": "Project Jupyter is a non-profit, open-source project that was born out of the IPython Project in 2014 as IPython evolved to support interactive data science and scientific computing in many different programming languages."
    },
    {
        "term": "JupyterLab",
        "meaning": "JupyterLab is a next-generation interface to Jupyter Notebooks. JupyterLab is open-source, web-based and has a multiple-document interface which supports working with multiple notebooks and Markdown files in a single browser tab. JupyterLab also supports opening terminal/console windows in the browser."
    },
    {
        "term": "k-means clustering",
        "meaning": "An unsupervised_learning algorithm that forms k groups by repeatedly calculating the centroid of the current groups and then reallocating data points to the nearest centroid until the centroids no longer move."
    },
    {
        "term": "k-nearest neighbors",
        "meaning": "A classification algorithm that classifies data points based on their similarity to their k nearest neighbours."
    },
    {
        "term": "kebab case",
        "meaning": "A naming convention in which the parts of a name are separated with dashes, as in first-second-third."
    },
    {
        "term": "key",
        "meaning": "A field or combination of fields whose value(s) uniquely identify a record within a table or dataset. Keys are often used to select specific records and in joins. 2. Part of a key/value pair, used as a unique identifier in a data structure such as a dictionary."
    },
    {
        "term": "keyword arguments",
        "meaning": "Extra (often optional) arguments given to a function as key/value pairs."
    },
    {
        "term": "label (an issue)",
        "meaning": "A short textual tag associated with an issue to categorize it. Common labels include bug and feature request."
    },
    {
        "term": "latent variable",
        "meaning": "A variable that is not observed directly but instead is inferred from the states or values of other variables."
    },
    {
        "term": "LaTeX",
        "meaning": "A typesetting system for document preparation that uses a specialized markup language to define a document structure (e.g., headings), stylise text, insert mathematical equations, and manage citations and cross-references. LaTeX is widely used in academia, in particular for scientific papers and theses in mathematics, physics, engineering, and computer science."
    },
    {
        "term": "lazy evaluation",
        "meaning": "Delaying evaluation of an expression until the value is actually needed or, in the case of a conditional expression, only evaluating as much of the expression as is necessary. For instance, the second half of A and B will only be evaluated if A is truthy."
    },
    {
        "term": "left join",
        "meaning": "A join that combines data from two tables, A and B, where keys in table A match keys in table B, fields are concatenated. Where a key in table A does not match a key in table B, columns from table B are filled with null, NA, or some other missing value. Keys from table B that do not match keys from table A are excluded for the result."
    },
    {
        "term": "lexical scoping",
        "meaning": "To look up the value associated with a name according to the textual structure of a program. Most programming languages use lexical scoping instead of dynamic scoping because the latter is less predictable."
    },
    {
        "term": "library",
        "meaning": "A reusable software package, also often called a module."
    },
    {
        "term": "license",
        "meaning": "A legal document describing how something can be used, and by whom."
    },
    {
        "term": "lifecycle",
        "meaning": "The steps that something is allowed or required to go through. The lifecycle of an object runs from its construction through the operations it can or must perform before it is destroyed; the lifecycle of an issue may be: “created”, “assigned”, “in progress”, “ready for review”, and “completed”."
    },
    {
        "term": "lift",
        "meaning": "How well a model predicts or classifies things, measured as the ratio of the response in the segment identified to the response in the population as a whole. A lift of 1 means the model does no better than chance; higher lift means the model is doing better."
    },
    {
        "term": "line comment",
        "meaning": "A comment in a program that spans part of a single line, as opposed to a block comment that may span multiple lines."
    },
    {
        "term": "linear regression",
        "meaning": "A method for finding the best straight-line fit between two datasets, typically by minimizing the squares of the distances between the points and a regression line."
    },
    {
        "term": "linter",
        "meaning": "A program that checks for common problems in software, such as violations of indentation rules or variable naming conventions. The name comes from the first tool of its kind, called lint."
    },
    {
        "term": "Lisp",
        "meaning": "A family of programming languages that represent programs and data as nested lists. Many other programming languages have borrowed ideas from Lisp."
    },
    {
        "term": "list comprehension",
        "meaning": "In Python, an expression that creates a new list in place. For example, [2*x for x in values] creates a new list whose items are the doubles of those in values."
    },
    {
        "term": "list",
        "meaning": "A vector that can contain values of many different (heterogeneous) types."
    },
    {
        "term": "literate programming",
        "meaning": "A programming paradigm that mixes prose and code."
    },
    {
        "term": "local installation",
        "meaning": "Placing a package inside a particular project so that it is only accessible within that project."
    },
    {
        "term": "local variable",
        "meaning": "A variable defined inside a function which is only visible within that function."
    },
    {
        "term": "log message",
        "meaning": "A single entry in a log of a program’s execution. Log messages are usually highly structured so that data (such as the time or the severity) can be recovered later."
    },
    {
        "term": "log",
        "meaning": "A record of a program’s execution containing messages written via a logging framework for later inspection."
    },
    {
        "term": "logging framework",
        "meaning": "A software library that manages internal reporting for programs."
    },
    {
        "term": "logging level",
        "meaning": "A setting that controls how much information is generated by a logging framework. Typical logging levels include DEBUG, WARNING, and ERROR."
    },
    {
        "term": "logical indexing",
        "meaning": "To index a vector or other structure with a vector of Booleans, keeping only the values that correspond to true values. Also referred to as masking."
    },
    {
        "term": "logistic regression",
        "meaning": "A method for fitting a model to some data that uses logistic (S-shaped) curves instead of straight lines."
    },
    {
        "term": "long identifier (of commit)",
        "meaning": "See full identifier."
    },
    {
        "term": "long option",
        "meaning": "A full-word identifier for a command-line argument. While most common flags are a single letter preceded by a dash, such as -v, long options typically use two dashes and a readable name, such as --verbose."
    },
    {
        "term": "loop body",
        "meaning": "The statement or statements executed by a loop."
    },
    {
        "term": "loop",
        "meaning": "A structure that repeatedly executes a section of code until a specific exit condition is met."
    },
    {
        "term": "lsof",
        "meaning": "UNIX command to see the list of open files being used by processes."
    },
    {
        "term": "machine learning",
        "meaning": "The study or use of algorithms whose performance improves as they are given more data. Machine learning algorithms often use training data to build a model. Their performance is then measured by how well they predict the properties of test data."
    },
    {
        "term": "magic number",
        "meaning": "An unnamed numerical constant that appears in a program without explanation."
    },
    {
        "term": "Make",
        "meaning": "The original build manager for Unix, still in daily use after more than forty years."
    },
    {
        "term": "Makefile",
        "meaning": "A file containing commands for Make, often actually called Makefile."
    },
    {
        "term": "Markdown",
        "meaning": "A markup language with a simple syntax intended as a replacement for HTML. Markdown is often used for README files, and is the basis for R markdown."
    },
    {
        "term": "Markov Chain",
        "meaning": "Any model describing a series of events in which the probability of each event depends only on the current state, not on the path taken to reach that state."
    },
    {
        "term": "markup language",
        "meaning": "A set of rules for annotating text to define its meaning or how it should be displayed. The markup is usually not displayed, but instead controls how the underlying text is interpreted or shown. Markdown and HTML are widely-used markup languages for web pages."
    },
    {
        "term": "Martha's Rules",
        "meaning": "A simple set of rules for making decisions in small groups."
    },
    {
        "term": "Masking",
        "meaning": "[TODO] to be define"
    },
    {
        "term": "master branch",
        "meaning": "A dedicated, permanent, central branch which should contain a “ready product”. After a new feature is developed on a separate branch to avoid breaking the main code, it can be merged into the master branch."
    },
    {
        "term": "maximum likelihood estimation",
        "meaning": "To choose the parameters for a probability distribution in order to maximize the likelihood of obtaining observed data."
    },
    {
        "term": "mean absolute error",
        "meaning": "The average error of all predicted values compared with actual values."
    },
    {
        "term": "mean squared error",
        "meaning": "The average of the squares of all the errors of all predicted values compared with actual values. Squaring makes larger errors count for more, and transforms negative errors into positive values, making this a more popular measure than mean absolute error."
    },
    {
        "term": "mean",
        "meaning": "The average value of a dataset, more properly known as the arithmetic mean to distinguish it from the geometric and harmonic means."
    },
    {
        "term": "median",
        "meaning": "A value separating the upper and lower halves of a sorted dataset. The median often gives a better idea of what is typical of the dataset than the mean, which can be influenced by a small number of extreme outliers. If the dataset contains an even number of elements, this is the average of the two central elements."
    },
    {
        "term": "merge (Git)",
        "meaning": "See Git merge"
    },
    {
        "term": "method",
        "meaning": "An implementation of a generic function that handles objects of a specific class."
    },
    {
        "term": "milestone",
        "meaning": "A target that a project is trying to meet, often represented as a set of issues that all have to be resolved by a certain time."
    },
    {
        "term": "MIME type",
        "meaning": "A standard way to identify the contents of files on the internet. The term is an acronym of “multi-purpose Internet mail extension”, and MIME types are often identified by filename extensions, such as .png for PNG-formatted images."
    },
    {
        "term": "minimum spanning tree (MST)",
        "meaning": "A minimum spanning tree is a data structure that describes the unique set of edges that connect all of the nodes in a graph while minimizing the weights of all included edges. The minimum spanning tree may refer to either the algorithm to calculate the structure or the resulting structure itself"
    },
    {
        "term": "missing value",
        "meaning": "A special value such as null or NA used to indicate the absence of data. Missing values can signal that data was not collected or that the data did not exist in the first place (e.g., the middle name of someone who does not have one)."
    },
    {
        "term": "MIT License",
        "meaning": "A license that allows people to re-use software with no restrictions."
    },
    {
        "term": "mock object",
        "meaning": "A simplified replacement for part of a program whose behavior is easy to control and predict. Mock objects are used in unit tests to simulate databases, web services, and other complex systems."
    },
    {
        "term": "mode",
        "meaning": "The value, or values, that occurs most frequently in a dataset."
    },
    {
        "term": "model",
        "meaning": "A specification of the mathematical relationship between different variables."
    },
    {
        "term": "module",
        "meaning": "A reusable software package, also often called a library."
    },
    {
        "term": "Monte Carlo method",
        "meaning": "Any method or algorithm that relies on artificially-injected randomness."
    },
    {
        "term": "moving average",
        "meaning": "The mean of each set of several consecutive values from time series data"
    },
    {
        "term": "multi-threaded",
        "meaning": "Capable of performing several operations simultaneously. Multi-threaded programs are usually more efficient than single-threaded ones, but also harder to understand and debug"
    },
    {
        "term": "mutable type",
        "meaning": "An object of this type may be changed and its state can be modified after it is created"
    },
    {
        "term": "mutation",
        "meaning": "Changing data in place, such as modifying an element of an array or adding a record to a database"
    },
    {
        "term": "n-gram",
        "meaning": "A sequence of $N$ items, typically words in natural language. For example, a trigram is a sequence of three words. N-grams are often used as input in computational linguistics"
    },
    {
        "term": "n-th root",
        "meaning": "The n-th root of a positive number x is the number that when multiplied by itself n times produces x. This can commonly be calculated by raising x to the power of the reciprocal of n."
    },
    {
        "term": "NA",
        "meaning": "A special value used to represent data that is not available."
    },
    {
        "term": "naive Bayes classifier",
        "meaning": "Any classification algorithm based on Bayes’ Theorem that assumes every feature being classified is independent of every other feature"
    },
    {
        "term": "name collision",
        "meaning": "The ambiguity that arises when two or more things in a program that have the same name are active at the same time. Most languages use namespaces to prevent such collisions."
    },
    {
        "term": "named argument",
        "meaning": "A function parameter that is given a value by explicitly naming it in a function call."
    },
    {
        "term": "namespace",
        "meaning": "A collection of names in a program that exists in isolation from other namespaces. Each function, object, class, or module in a program typically has its own namespace so that references to “X” in one part of a program do not accidentally refer to something called “X” in another part of the program. Scope is a distinct, but related, concept."
    },
    {
        "term": "Nano (editor)",
        "meaning": "A very simple text editor found on most Unix systems"
    },
    {
        "term": "natural language processing (NLP)",
        "meaning": "See computational linguistics."
    },
    {
        "term": "negative selection",
        "meaning": "To specify the elements of a vector or other data structure that are not desired by negating their indices"
    },
    {
        "term": "neural network",
        "meaning": "One of a large family of algorithms for identifying patterns in data by mimicking the way neurons interact. A neural network consists of one or more layers of nodes, each of which is connected to nodes in the preceding and subsequent layer. If enough of a node’s inputs are active, that node activates as well."
    },
    {
        "term": "node",
        "meaning": "An element of a graph that is connected to other nodes by edges. Nodes typically have data associated with them, such as names or weights."
    },
    {
        "term": "non-blocking execution",
        "meaning": "To allow a program to continue running while an operation is in progress. For example, many systems support non-blocking execution for file I/O so that the program can continue doing work while it waits for data to be read from or written to the filesystem (which is typically much slower than the CPU)"
    },
    {
        "term": "normal distribution",
        "meaning": "A continuous random distribution with a symmetric bell-curve shape. As datasets get larger, some of their most important statistical properties can be modeled using a normal distribution"
    },
    {
        "term": "NoSQL database",
        "meaning": "Any database that does not use the relational model. The name comes from the fact that such databases do not use SQL as a query language."
    },
    {
        "term": "null hypothesis",
        "meaning": "The claim that any patterns seen in data are entirely due to chance. Other claims (e.g., “X causes Y”) must be much more likely than the null hypothesis in order to be substantiated."
    },
    {
        "term": "null",
        "meaning": "A special value used to represent a missing object. Null is not the same as NA, and neither is it the same as an empty vector."
    },
    {
        "term": "nullary expression",
        "meaning": "An “expression” with no arguments, such as the value 3."
    },
    {
        "term": "numpy",
        "meaning": "An open source Python package that works with arrays, vectors and matrices of dimension N, in a comparable method and with a syntax similar at Matlab software. You can find functions and sophisticated operations, focused in multidimensional arrays, linear algebra, Fourrier transform and generation of random values."
    },
    {
        "term": "object-oriented programming (OOP)",
        "meaning": "A style of programming in which functions and data are bound together in objects that only interact with each other through well-defined interfaces."
    },
    {
        "term": "object",
        "meaning": "In object-oriented programming, a structure that contains the data for a specific instance of a class. The operations the object is capable of are defined by the class’s methods."
    },
    {
        "term": "objective function",
        "meaning": "A function of one or more variables used to measure or compare the goodness of different solutions in an optimization problem."
    },
    {
        "term": "observation",
        "meaning": "A value or property of a specific member of a population."
    },
    {
        "term": "off-by-one error",
        "meaning": "A common error in programming in which the program refers to element i of a structure when it should refer to element i-1 or i+1, or processes N elements when it should process N-1 or N+1"
    },
    {
        "term": "open license",
        "meaning": "A license that permits general re-use, such as the MIT License or GPL for software and CC-BY or CC-0 for data, prose, or other creative outputs."
    },
    {
        "term": "open science",
        "meaning": "A generic term for making scientific software, data, and publications generally available."
    },
    {
        "term": "OpenRefine",
        "meaning": "A standalone, open source desktop application for data cleanup and transformations, also know as data wrangling."
    },
    {
        "term": "operating system",
        "meaning": "A program that provides a standard interface to whatever hardware it is running on. Theoretically, any program that only interacts with the operating system should run on any computer that operating system runs on."
    },
    {
        "term": "optional_parameter",
        "meaning": "A parameter that does not have to be given a value when a function is called. Most programming languages require programmers to define default values for optional parameters, or assign them a special value automatically. Arguments passed to optional parameters will often be specified using keyword arguments"
    },
    {
        "term": "ORCID",
        "meaning": "An Open Researcher and Contributor ID that uniquely and persistently identifies an author of scholarly works. ORCIDs are for people what DOIs are for documents"
    },
    {
        "term": "orthogonality",
        "meaning": "The ability to use various features of software in any order or combination. Orthogonal systems tend to be easier to understand, since features can be combined without worrying about unexpected interactions"
    },
    {
        "term": "outlier",
        "meaning": "Extreme values that might be measurement or recording errors, or might actually be rare events. Outliers are sometimes ignored when doing statistics, or handled or visualized separately."
    },
    {
        "term": "overfitting",
        "meaning": "Fitting a model so closely to one dataset that it does not generalize to others."
    },
    {
        "term": "p value",
        "meaning": "The probability of obtaining a result at least as strong as the one observed if the null_hypothesis is true (i.e., if variation is purely due to chance). The lower the p-value, the more likely it is that something other than chance is having an effect"
    },
    {
        "term": "package manager",
        "meaning": "A program that does its best to keep track of the different software installed on a computer and their dependencies on one another"
    },
    {
        "term": "package",
        "meaning": "A collection of code, data, and documentation that can be distributed and re-used. Also referred to in some languages as a library or module."
    },
    {
        "term": "pager",
        "meaning": "A program that displays a few lines of text at a time"
    },
    {
        "term": "pandas",
        "meaning": "An open source Python package that offers fast, flexible, and expressive data structures to make working with structured data, and time series easy and intuitive. It is a powerful tool for data analysis and data manipulation."
    },
    {
        "term": "parameter",
        "meaning": "A variable specified in a function definition whose value is passed to the function when the function is called. Parameters and arguments are distinct, but related concepts. Parameters are variables and arguments are the values assigned to those variables."
    },
    {
        "term": "parametric (statistics)",
        "meaning": "A branch of statistical tests which assume a known distribution of the population which the samples were taken from (ANOVA and Student’s t-tests are examples of parametric tests)."
    },
    {
        "term": "parent (in a tree)",
        "meaning": "A node in a tree that is above another node (call a child). Every node in a tree except the root node has a single parent"
    },
    {
        "term": "parent class",
        "meaning": "In object-oriented programming, the class from which a sub class (called the child class) is derived."
    },
    {
        "term": "parent directory",
        "meaning": "The directory that contains another directory of interest. Going from a directory to its parent, then its parent, and so on eventually leads to the root directory of the filesystem."
    },
    {
        "term": "parse",
        "meaning": "To translate the text of a program or web page into a data structure in memory that the program can then manipulate"
    },
    {
        "term": "pass (a test)",
        "meaning": "A test passes if the actual result matches the expected result."
    },
    {
        "term": "patch",
        "meaning": "A single file containing a set of changes to a set of files, separated by markers that indicate where each individual change should be applied"
    },
    {
        "term": "path (in filesystem)",
        "meaning": "A string that specifies a location in a filesystem. In Unix, the directories in a path are joined using /."
    },
    {
        "term": "pattern rule",
        "meaning": "A generic build rule that describes how to update any file whose name matches a pattern. Pattern rules often use automatic variables to represent the actual filenames"
    },
    {
        "term": "Peanuts",
        "meaning": "An American comic strip by Charles M. Schulz which has inspired the names of R versions"
    },
    {
        "term": "perceptron",
        "meaning": "The simplest kind of [neural network])(#neural_network), which approximates a single neuron with N binary inputs by computing a weighted sum of its inputs and firing if that value is zero or greater"
    },
    {
        "term": "permalink",
        "meaning": "Short for “permanent link”, a URL that is intended to last forever."
    },
    {
        "term": "phony target",
        "meaning": "A build target that does not correspond to an actual file. Phony targets are often used to store commonly used commands in a Makefile"
    },
    {
        "term": "Pip Install Packages (PIP)",
        "meaning": "The standard package manager for Python. pip enables the download and installation of Python packages not included in the standard library."
    },
    {
        "term": "pipe (in the Unix shell)",
        "meaning": "The | used to make the output of one command the input of the next"
    },
    {
        "term": "pipe operator",
        "meaning": "The %>% used to make the output of one function the input of the next"
    },
    {
        "term": "pivot table",
        "meaning": "A technique for summarizing tabular data in which each cell represents the sum, average, or other function of the subset of the original data identified by the cell’s row and column heading"
    },
    {
        "term": "Poisson distribution",
        "meaning": "A discrete random distribution that expresses the probability of $N$ events occurring in a fixed time interval if the events occur at a constant rate, independent of the time since the last event"
    },
    {
        "term": "positional argument",
        "meaning": "An argument to a function that gets its value according to its place in the function’s definition, as opposed to a named argument that is explicitly matched by name."
    },
    {
        "term": "Post Office Protocol (POP)",
        "meaning": "A standard internet protocol used by email clients to retrieve messages from an email server. Messages are generally downloaded and deleted from the server, making it difficult to access messages from multiple email clients. POP3 (version 3) is the version of POP in common use."
    },
    {
        "term": "posterior distribution",
        "meaning": "Probability distribution summarizing the prior distribution and the likelihood function."
    },
    {
        "term": "pothole case",
        "meaning": "A naming style that separates the parts of a name with underscores, as in first_second_third."
    },
    {
        "term": "preamble",
        "meaning": "A series of commands, either placed in the main document, or kept in a separate document, that are included prior to the \\begin{document} command. The preamble defines the type of the document, along with other formatting attributes and parameters. This is also the section of the document where packages are added using the command \\usepackage{} to enable additional functionalities, and where custom commands can be defined."
    },
    {
        "term": "prerequisite",
        "meaning": "Something that a build target depends on."
    },
    {
        "term": "principal component analysis (PCA)",
        "meaning": "An algorithm that find the axis along which data varies most, then the axis that accounts for the largest part of the remaining variation, and so on."
    },
    {
        "term": "prior distribution",
        "meaning": "The probability distribution that is assumed as a starting point when using Bayes’ Theorem and used to construct a more accurate posterior_distribution"
    },
    {
        "term": "probability distribution",
        "meaning": "A mathematical description of all possible outcomes of a random event, and the probability of each occurring"
    },
    {
        "term": "procedural generation",
        "meaning": "A method of generating data algorithmically rather than manually. Typically this is done to reduce file sizes, increase the overall amount of content, and/or incorporate randomness at the expense of processing power"
    },
    {
        "term": "procedural programming",
        "meaning": "A style of programming in which functions operate on data that is passed into them. The term is used in contrast to other programming styles, such as object-oriented programming and functional programming"
    },
    {
        "term": "process",
        "meaning": "An operating system’s representation of a running program. A process typically has some memory, the identity of the user who is running it, and a set of connections to open files"
    },
    {
        "term": "product manager",
        "meaning": "The person responsible for defining what features a product should have"
    },
    {
        "term": "production code",
        "meaning": "Software that is delivered to an end user. The term is used to distinguish such code from test code, deployment infrastructure, and everything else that programmers write along the way"
    },
    {
        "term": "project manager",
        "meaning": "The person responsible for ensuring that a project moves forward"
    },
    {
        "term": "prompt",
        "meaning": "The text printed by an REPL or shell that indicates it is ready to accept another command. The default prompt in the Unix shell is usually $, while in Python it is >>>, and in R it is >."
    },
    {
        "term": "protocol",
        "meaning": "Any standard specifying how two pieces of software interact. A network protocol such as HTTP defines the messages that clients and servers exchange on the World-Wide Web; object-oriented programs often define protocols for interactions between objects of different classes"
    },
    {
        "term": "provenance",
        "meaning": "A record of where data originally came from and what was done to process it"
    },
    {
        "term": "pseudo-random number generator (PRNG)",
        "meaning": "A function that can generate pseudo-random numbers."
    },
    {
        "term": "pseudo-random number",
        "meaning": "A value generated in a repeatable way that resembles the true randomness of the universe well enough to fool observers."
    },
    {
        "term": "pull indexing",
        "meaning": "Vectorized indexing in which the value at location i in the index vector specifies which element of the source vector is being pulled into that location in the result vector, i.e., result[i] = source[index[i]]."
    },
    {
        "term": "pull request",
        "meaning": "The request to merge a new feature or correction created on a user’s fork of a Git repository into the upstream repository. The developer will be notified of the change, review it, make or suggest changes, and potentially merge it"
    },
    {
        "term": "push indexing",
        "meaning": "Vectorized indexing in which the value at location i in the index vector specifies an element of the result vector that gets the corresponding element of the source vector, i.e., result[index[i]] = source[i]. Push indexing can easily produce gaps and collisions."
    },
    {
        "term": "Python Package Index (PyPI)",
        "meaning": "The official third-party software repository for Python. Anyone can upload a package to PyPI. PyPI packages may install via executed scripts or pre-compiled, system-specific wheels."
    },
    {
        "term": "Python Software Foundation (PSF)",
        "meaning": "A non-profit organization that oversees and promotes the development and use of Python"
    },
    {
        "term": "Python",
        "meaning": "A popular interpreted open-source programming language that relies on indentation to define control structure."
    },
    {
        "term": "quantile",
        "meaning": "If a set of sorted values are divided into groups of each size, each group is called a quantile. For example, if there are five groups, each is called a quintile; the bottom quintile contains the lowest 20% of the values, while the top quintile contains the highest 20%"
    },
    {
        "term": "query string",
        "meaning": "The portion of a URL after the question mark ? that specifies extra parameters for the HTTP request as name-value pairs"
    },
    {
        "term": "quosure",
        "meaning": "A data structure containing an unevaluated expression and its environment"
    },
    {
        "term": "quoting function",
        "meaning": "A function that is passed expressions rather than the values of those expressions"
    },
    {
        "term": "R (programming language)",
        "meaning": "A popular open-source programming language used primarily for data science."
    },
    {
        "term": "R Consortium",
        "meaning": "A group that supports the worldwide community of users, maintainers and developers of R. Its members include leading institutions and companies dedicated to the use, development, and growth of R"
    },
    {
        "term": "R Foundation",
        "meaning": "A non-profit founded by the R development core team providing support for R. It is a member of the R Consortium"
    },
    {
        "term": "R Hub",
        "meaning": "A free platform available to check an R package on several different platforms in preparation for the CRAN submission process"
    },
    {
        "term": "R Markdown",
        "meaning": "A dialect of Markdown that allows authors to mix prose and code (usually written in R) in a single document."
    },
    {
        "term": "raise (an exception)",
        "meaning": "To signal that something unexpected or unusual has happened in a program by creating an exception and handing it to the error-handling system, which then tries to find a point in the program that will catch it."
    },
    {
        "term": "random forests",
        "meaning": "An algorithm used for regression or classification that uses a collection of decision trees, called a forest. Each tree votes for a classification, and the algorithm chooses the classification having the most votes over all the trees in the forest"
    },
    {
        "term": "raster image",
        "meaning": "An image stored as a matrix of pixels."
    },
    {
        "term": "reactive programming",
        "meaning": "A style of programming in which actions are triggered by external events"
    },
    {
        "term": "reactive variable",
        "meaning": "A variable whose value is automatically updated when some other value or values change. Reactive variables are used extensively in Shiny"
    },
    {
        "term": "read-eval-print loop (REPL)",
        "meaning": "An interactive program that reads a command typed in by a user, executes it, prints the result, and then waits patiently for the next command. REPLs are often used to explore new ideas, or for debugging."
    },
    {
        "term": "README",
        "meaning": "A plain text file containing important information about a project or software package."
    },
    {
        "term": "reciprocal",
        "meaning": "The reciprocal of a number x is 1 / x, or alternatively x raised to the power of -1"
    },
    {
        "term": "record",
        "meaning": "A group of related values that are stored together. A record may be represented as a tuple or as a row in a table; in the latter case, every record in the table has the same fields."
    },
    {
        "term": "recursion",
        "meaning": "Calling a function from within a call to that function, or defining a term using a simpler version of the same term."
    },
    {
        "term": "recycle",
        "meaning": "To re-use values from a shorter vector in order to generate a sequence of the same length as a longer one. In Python NumPy, this is called broadcasting."
    },
    {
        "term": "redirection",
        "meaning": "To send a request for a web page or web service to a different page or service"
    },
    {
        "term": "refactoring",
        "meaning": "Reorganizing software without changing its behavior"
    },
    {
        "term": "regression testing",
        "meaning": "Testing software to ensure that things which used to work have not been broken"
    },
    {
        "term": "regular expression",
        "meaning": "A pattern for matching text, written as text itself. Regular expressions are sometimes called “regexp”, “regex”, or “RE”, and are powerful tools for working with text."
    },
    {
        "term": "reinforcement learning",
        "meaning": "Any machine learning algorithm which is not given specific goals to meet, but instead is given feedback on whether or not it is making progress."
    },
    {
        "term": "relational database",
        "meaning": "A database that organizes information into tables, each of which has a fixed set of named fields (shown as columns) and a variable number of records (shown as rows)."
    },
    {
        "term": "relative error",
        "meaning": "The absolute value of the difference between the actual and correct value divided by the correct value. For example, if the actual value is 9 and the correct value is 10, the relative error is 0.1. Relative error is usually more useful than absolute error."
    },
    {
        "term": "relative path",
        "meaning": "A path whose destination is interpreted relative to some other location, such as the current working directory. A relative path is the equivalent of giving directions using terms like “straight” and “left”."
    },
    {
        "term": "relative row number",
        "meaning": "The index of a row in a displayed portion of a table, which may or may not be the same as the absolute row number within the table."
    },
    {
        "term": "remote login",
        "meaning": "Starting an interactive session on one computer from another computer, e.g., by using SSH."
    },
    {
        "term": "remote repository",
        "meaning": "A repository located on another computer. Tools such as Git are designed to synchronize changes between local and remote repositories in order to share work"
    },
    {
        "term": "repository",
        "meaning": "A place where a version control system stores the files that make up a project and the metadata that describes their history."
    },
    {
        "term": "reprex",
        "meaning": "A reproducible example. When asking questions about coding problems online or filing issues on GitHub, you should always include a reprex so others can reproduce your problem and help. The reprex package can help"
    },
    {
        "term": "reproducible example",
        "meaning": "See reprex"
    },
    {
        "term": "reproducible research",
        "meaning": "The practice of describing and documenting research results in such a way that another researcher or person can re-run the analysis code on the same data to obtain the same result."
    },
    {
        "term": "research software engineer (RSE)",
        "meaning": "Someone whose primary responsibility is to build the specialized software that other researchers depend on"
    },
    {
        "term": "research software engineering (RSEng)",
        "meaning": "The practice of and methods for building the specialized software that other researchers depend on"
    },
    {
        "term": "reserved word",
        "meaning": "A word (character string) with a distinct meaning for a programming or scripting language. Typically, reserved words cannot be used as names for variables or constants, as this would confuse the compiler or interpreter"
    },
    {
        "term": "reStructured Text (reST)",
        "meaning": "A plaintext markup format used primarily in Python documentation."
    },
    {
        "term": "revision",
        "meaning": "See commit"
    },
    {
        "term": "right join",
        "meaning": "A join that combines data from two tables, A and B. Where keys in table A match keys in table B, fields are concatenated. Where a key in table B does not match a key in table A, columns from table A are filled with null, NA, or some other missing value signifier. Keys from table A that do not exist in table B are dropped."
    },
    {
        "term": "root (in a tree)",
        "meaning": "The node in a tree of which all other nodes are direct or indirect children, or equivalently the only node in the tree that has no parent"
    },
    {
        "term": "root directory",
        "meaning": "The directory that contains everything else, either directly or indirectly. The root directory is written / (a bare forward slash)"
    },
    {
        "term": "root mean squared error (RMSE)",
        "meaning": "The square root of the mean squared error. Like the standard deviation, it is in the same units as the original data."
    },
    {
        "term": "rotating file",
        "meaning": "A set of files used to store recent information. For example, there might be one file with results for each day of the week, so that results from last Tuesday are overwritten this Tuesday"
    },
    {
        "term": "S3",
        "meaning": "A framework for object-oriented programming in R."
    },
    {
        "term": "S4",
        "meaning": "A framework for object-oriented programming in R"
    },
    {
        "term": "S",
        "meaning": "A language originally developed in Bell Labs for data analysis, statistical modeling, and graphics. R is a dialect of S."
    },
    {
        "term": "sandbox",
        "meaning": "A testing environment that is separate from the production system, or an environment that is only allowed to perform a restricted set of operations for security reasons"
    },
    {
        "term": "sanity check",
        "meaning": "A basic test to see if the outcome of a calculation, script or analysis makes sense or is true.   This can be performed by visualisation or by simply inspecting the outcome"
    },
    {
        "term": "scalar",
        "meaning": "A single value of a particular type, such as 1 or “a”. Scalars exist in most languages, but do not really exist in R; in R, values that appear to be scalars are actually vectors of unit length."
    },
    {
        "term": "schema",
        "meaning": "A specification of the format of a dataset, including the name, format, and content of each table."
    },
    {
        "term": "scope",
        "meaning": "The portion of a program within which a definition can be seen and used. See closure, global variable, and local variable."
    },
    {
        "term": "script",
        "meaning": "Originally, a program written in a language too user-friendly for “real” programmers to take seriously; the term is now synonymous with program"
    },
    {
        "term": "search path",
        "meaning": "The list of directories that a program searches to find something. For example, the Unix shell uses the search path stored in the PATH variable when trying to find a program whose name it has been given"
    },
    {
        "term": "Secure Shell (SSH)",
        "meaning": "A protocol and the program that implements it which allows remote access to a server through a secure channel where all information is encrypted."
    },
    {
        "term": "seed",
        "meaning": "A value used to initialize a pseudo-random number generator."
    },
    {
        "term": "select",
        "meaning": "To choose entire columns or rows from a table by name or location."
    },
    {
        "term": "self join",
        "meaning": "A join that combines a table with itself."
    },
    {
        "term": "semantic versioning",
        "meaning": "A standard for identifying software releases. In the version identifier major.minor.patch, major changes when a new version of software is incompatible with old versions, minor changes when new features are added to an existing version, and patch changes when small bugs are fixed"
    },
    {
        "term": "sense vote",
        "meaning": "A preliminary vote used to determine whether further discussion is needed in a meeting."
    },
    {
        "term": "sensitivity",
        "meaning": "Statistical measure of a classification model which gives the True Positive rate. For  example, the proportion of people who have a disease that test positive. Calculated  as Sensitivity = TP/(TP+FN)"
    },
    {
        "term": "sequential data",
        "meaning": "Any list of data items where the order is an inherent property of the list. Often the next item in the list is dependent on the previous item or items"
    },
    {
        "term": "server",
        "meaning": "Typically, a program such as a database manager or web server that provides data to a client upon request."
    },
    {
        "term": "shader",
        "meaning": "A program designed to run on the [GPU][gpu]. Generally used in graphics to calculate lighting or position vertices in a scene, though can be used for more general programming through the use of [compute shaders][#compute_shader]."
    },
    {
        "term": "shebang",
        "meaning": "In Unix, a character sequence such as #!/usr/bin/python in the first line of an executable file that tells the shell what program to use to run that file"
    },
    {
        "term": "shell script",
        "meaning": "A set of commands for the shell stored in a file so that they can be re-executed. A shell script is effectively a program"
    },
    {
        "term": "shell variable",
        "meaning": "A variable set and used in the Unix shell. Commonly used shell variables include HOME (the user’s home directory) and PATH (their search path)"
    },
    {
        "term": "shell",
        "meaning": "A command-line interface that allows a user to interact with the operating system, such as Bash (for Unix and MacOS) or PowerShell (for Windows)"
    },
    {
        "term": "Shiny",
        "meaning": "A R package that makes it simple to build web applications to interactively visualise and manipulate data. Often used to make interactive graphs and tables straight from R without having to know HTML, CSS or JavaScript"
    },
    {
        "term": "short circuit test",
        "meaning": "A logical test that only evaluates as many arguments as it needs to. For example, if A is false, then most languages never evaluate B in the expression A and B."
    },
    {
        "term": "short identifier (of commit)",
        "meaning": "The first few characters of a full identifier. Short identifiers are easy for people to type and say aloud, and are usually unique within a repository’s recent history"
    },
    {
        "term": "short option",
        "meaning": "A single-letter identifier for a command-line argument. Most common flags are a single letter preceded by a dash, such as -v."
    },
    {
        "term": "side effect",
        "meaning": "A change made by a function while it runs that is visible after the function finishes, such as modifying a global variable or writing to a file. Side effects make programs harder for people to understand, since the effects are not necessarily clear at the point in the program where the function is called"
    },
    {
        "term": "signal (a condition)",
        "meaning": "A way of indicating that something has gone wrong in a program, or that some other unexpected event has occurred. R prefers “signalling a condition” to “raising an exception”. Python, on the other hand, encourages raising and catching exceptions, and in some situations, requires it"
    },
    {
        "term": "Simple Mail Transfer Protocol Secure (SMTPS)",
        "meaning": "A method for securing SMTP using TLS."
    },
    {
        "term": "Simple Mail Transfer Protocol (SMTP)",
        "meaning": "A standard internet communication protocol for transmitting email."
    },
    {
        "term": "single square brackets",
        "meaning": "One set of square brackets [ ], used to select a structure from another structure based on an index value, or range of values, inside the square brackets."
    },
    {
        "term": "single-threaded",
        "meaning": "A model of program execution in which only one thing can happen at a time. Single-threaded execution is easier for people to understand, but less efficient than multi-threaded execution"
    },
    {
        "term": "Singleton pattern",
        "meaning": "A design pattern that creates a singleton object to manage some resource or service, such as a database or cache. In object-oriented programming, the pattern is usually implemented by hiding the constructor of the class in some way so that it can only be called once"
    },
    {
        "term": "singleton",
        "meaning": "A set with only one element, or a class with only one instance."
    },
    {
        "term": "slug",
        "meaning": "An abbreviated portion of a page’s URL that uniquely identifies it. In the example https://www.mysite.com/category/post-name, the slug is post-name"
    },
    {
        "term": "snake case",
        "meaning": "See pothole case."
    },
    {
        "term": "software distribution",
        "meaning": "A set of programs that are built, tested, and distributed as a collection so that they can run together."
    },
    {
        "term": "source code",
        "meaning": "Source code or, simply, code, is the origin of executed code (either by means of an interpreter or compiler). It’s the primarily human-produced series of commands that make up a program. (Note: Automatic code generators exist for some applications"
    },
    {
        "term": "source distribution",
        "meaning": "A software distribution that includes the source code, typically so that programs can be recompiled on the target computer when they are installed"
    },
    {
        "term": "specificity",
        "meaning": "Statistical measure of a classification model which gives the False Negative rate.  For example, the proportion of people who do not have a disease that test negative.  Calculated as Specificity = TN/(TN+FP)"
    },
    {
        "term": "spectral analysis/ spectrum analysis problem",
        "meaning": "From a finite record of a stationary data sequence, estimate how the total power is distributed over frequency."
    },
    {
        "term": "sprint",
        "meaning": "A short, intense period of work on a project"
    },
    {
        "term": "SQL",
        "meaning": "The language used for writing queries for a relational database. The term is an acronym for Structured Query Language."
    },
    {
        "term": "Square root",
        "meaning": "A special case of the n-th root for which n = 2, i.e. the 2-nd root has the special name “square root”"
    },
    {
        "term": "SSH key",
        "meaning": "A string of random bits stored in a file that is used to identify a user for SSH. Each SSH key has separate public and private parts; the public part can safely be shared, but if the private part becomes known, the key is compromised"
    },
    {
        "term": "stack frame",
        "meaning": "A section of the call stack that records details of a single call to a specific function"
    },
    {
        "term": "Stack Overflow",
        "meaning": "A question-and-answer site popular among programmers."
    },
    {
        "term": "stale (in build)",
        "meaning": "To be out-of-date compared to a prerequisite. A build manager’s job is to find and update things that are stale."
    },
    {
        "term": "standard deviation",
        "meaning": "How widely values in a dataset differ from the mean. It is calculated as the square root of the variance."
    },
    {
        "term": "standard error",
        "meaning": "A predefined communication channel for a process, typically used for error messages."
    },
    {
        "term": "standard input",
        "meaning": "A predefined communication channel for a process, typically used to read input from the keyboard or from the previous process in a pipe."
    },
    {
        "term": "standard normal distribution",
        "meaning": "A normal distribution with a mean of 0 and a standard deviation of 1. Values from normal distributions with other parameters can easily be rescaled to be on a standard normal distribution."
    },
    {
        "term": "standard output",
        "meaning": "A predefined communication channel for a process, typically used to send output to the screen or to the next process in a pipe."
    },
    {
        "term": "stratified sampling",
        "meaning": "Selecting values by dividing the overall population into homogeneous groups and then taking a random sample from each group"
    },
    {
        "term": "stream",
        "meaning": "A sequential flow of data, such as the bits arriving across a network connection or the bytes read from a file"
    },
    {
        "term": "string interpolation",
        "meaning": "The process of inserting text corresponding to specified values into a string, usually to make output human-readable"
    },
    {
        "term": "string",
        "meaning": "A block of text in a program. The term is short for “character string”."
    },
    {
        "term": "student's t-distribution",
        "meaning": "See t-distribution"
    },
    {
        "term": "subcommand",
        "meaning": "A command that is part of a larger family of commands. For example, git commit is a subcommand of Git"
    },
    {
        "term": "subdirectory",
        "meaning": "A directory that is below another directory."
    },
    {
        "term": "supervised learning",
        "meaning": "A machine learning algorithm in which a system is taught to classify values given training data containing previously-classified values."
    },
    {
        "term": "support vector machine (SVM)",
        "meaning": "A supervised learning algorithm that seeks to divide points in a dataset so that the empty space between the resultant sets is as wide as possible"
    },
    {
        "term": "synchronous",
        "meaning": "To happen at the same time. In programming, synchronous operations are ones that have to run simultaneously, or complete at the same time."
    },
    {
        "term": "systematic error",
        "meaning": "See bias"
    },
    {
        "term": "t-distribution",
        "meaning": "A variation on the normal distribution that is adjusted to account for estimating variance from the sample instead of knowing it in advance."
    },
    {
        "term": "tab completion",
        "meaning": "A technique implemented by most REPLs, shells, and programming editors that completes a command, variable name, filename, or other text when the TAB key is pressed"
    },
    {
        "term": "table",
        "meaning": "A set of records in a relational database or observations in a data frame. Tables are usually displayed as rows (each of which represents one record or observation and columns (each of which represents a field or variable."
    },
    {
        "term": "tag (in version control)",
        "meaning": "A readable label attached to a specific commit so that it can easily be referenced later"
    },
    {
        "term": "Template Method pattern",
        "meaning": "A design pattern in which a parent class defines an overall sequence of operations by calling abstract methods that child classes must then implement. Each child class then behaves in the same general way, but implements the steps differently"
    },
    {
        "term": "ternary expression",
        "meaning": "An expression that has three parts. Conditional expressions are the only ternary expressions in most languages."
    },
    {
        "term": "tessellation shader",
        "meaning": "The [shader][#shader] stage in the rendering pipeline designated towards subdividing primitives to increase the resolution of a mesh without impacting memory. Not to be confused with [geometry shaders][#geometry_shader] which change the overall shape."
    },
    {
        "term": "test data",
        "meaning": "Test data is a portion of a dataset used to evaluate the correctness of a machine learning algorithm after it has been trained. It should always be separated from the training data to ensure that the model is properly tested with unseen data"
    },
    {
        "term": "test runner",
        "meaning": "A program that finds and runs software tests and reports their results"
    },
    {
        "term": "test-driven development (TDD)",
        "meaning": "A programming practice in which tests are written before a new feature is added or a bug is fixed in order to clarify the goal"
    },
    {
        "term": "three Vs",
        "meaning": "The volume, velocity, and variety that distinguish big data"
    },
    {
        "term": "throw (exception)",
        "meaning": "Another term for raising an exception"
    },
    {
        "term": "tibble",
        "meaning": "A modern replacement for R’s data frame, which stores tabular data in columns and rows, defined and used in the tidyverse."
    },
    {
        "term": "ticket",
        "meaning": "See issue"
    },
    {
        "term": "ticketing system",
        "meaning": "See issue tracking system"
    },
    {
        "term": "tidy data",
        "meaning": "Tabular data that satisfies three conditions that facilitate initial cleaning, and later exploration and analysis—(1) each variable forms a column, (2) each observation forms a row, and (3) each type of observation unit forms a table."
    },
    {
        "term": "Tidymodels",
        "meaning": "A collection of R packages for modeling and statistical analysis designed with a shared philosophy."
    },
    {
        "term": "Tidyverse",
        "meaning": "A collection of R packages for operating on tabular data in consistent ways."
    },
    {
        "term": "time series",
        "meaning": "A set of measurements taken at different times, which may or may not be regular intervals."
    },
    {
        "term": "timestamp",
        "meaning": "A digital identifier showing the time at which something was created or accessed. Timestamps should use ISO date format for portability"
    },
    {
        "term": "tolerance",
        "meaning": "How closely the actual result of a test must agree with the expected result in order for the test to pass. Tolerances are usually expressed in terms of relative error"
    },
    {
        "term": "training data",
        "meaning": "Training data is a portion of a dataset used to train machine learning algorithm to recognise similar data. It should always be separated from the test data to ensure that the model is properly tested with data it has never seen before"
    },
    {
        "term": "transitive dependency",
        "meaning": "If A depends on B and B depends on C, C is a transitive dependency of A"
    },
    {
        "term": "Transport Layer Security (TLS)",
        "meaning": "A cryptographic protocol for securing communications over a computer network"
    },
    {
        "term": "tree",
        "meaning": "A graph in which every node except the root has exactly one parent"
    },
    {
        "term": "triage",
        "meaning": "To go through the issues associated with a project and decide which are currently priorities. Triage is one of the key responsibilities of a project manager"
    },
    {
        "term": "true negative",
        "meaning": "Data points which are actually false and correctly predicted as false."
    },
    {
        "term": "true positive",
        "meaning": "Data points which are actually true and correctly predicted as true."
    },
    {
        "term": "true",
        "meaning": "The logical (Boolean) state opposite of “false”. Used in logic and programming to represent a binary state of something."
    },
    {
        "term": "truthy",
        "meaning": "Evaluating to true in a Boolean context."
    },
    {
        "term": "tuple",
        "meaning": "A data type that has a fixed number of parts, such as the three color components of a red-green-blue color specification. In “Python”, tuples are immutable (their values cannot be reset.)"
    },
    {
        "term": "two hard problems in computer science",
        "meaning": "Refers to a quote by Phil Karlton—”There are only two hard problems in computer science—cache invalidation and naming things.” Many variations add a third problem (most often “off-by-one errors”)"
    },
    {
        "term": "type coercion",
        "meaning": "To convert data from one type to another, e.g., from the integer 4 to the equivalent floating point number 4.0"
    },
    {
        "term": "unary expression",
        "meaning": "An expression with one argument, such as log 5."
    },
    {
        "term": "Unicode",
        "meaning": "A standard that defines numeric codes for many thousands of characters and symbols. Unicode does not define how those numbers are stored; that is done by standards like UTF-8."
    },
    {
        "term": "Uniform Resource Locator (URL)",
        "meaning": "A unique address on the World-Wide Web. URLs originally identified web pages, but may also represent datasets or database queries, particularly if they include a query string"
    },
    {
        "term": "unit test",
        "meaning": "A test that exercises one function or feature of a piece of software and produces pass, fail, or error."
    },
    {
        "term": "UNIX",
        "meaning": "UNIX is a family of operating systems developed during 1969 at AT&T Bell Labs. Its main features are simple tools, well-defined functionality and being portable by nature."
    },
    {
        "term": "unsupervised learning",
        "meaning": "Algorithms that cluster data without knowing in advance what the groups will be."
    },
    {
        "term": "up-vote",
        "meaning": "A vote in favor of something."
    },
    {
        "term": "update operator",
        "meaning": "See in-place operator"
    },
    {
        "term": "upstream repository",
        "meaning": "The remote repository from which this repository was derived. Programmers typically save changes in their own repository and then submit a pull request to the upstream repository where changes from other programmers are also collected"
    },
    {
        "term": "user interface (UI)",
        "meaning": "Platform for interaction between a user and a machine. The interaction may occur via text  (a command line interface), graphics and windows (a graphical user interface),  or other methods such as voice-driven interfaces."
    },
    {
        "term": "UTF-8",
        "meaning": "A way to store the numeric codes representing Unicode characters in memory that is backward-compatible with the older ASCII standard"
    },
    {
        "term": "variable (data)",
        "meaning": "Some attribute of a population that can be measured or observed."
    },
    {
        "term": "variable (program)",
        "meaning": "A name in a program that has some data associated with it. A variable’s value can be changed after definition."
    },
    {
        "term": "variable arguments",
        "meaning": "In a function, the ability to take any number of arguments. R uses ... to capture the “extra” arguments. Python uses *args and **kwargs to capture unnamed, and named, “extra” arguments, respectively."
    },
    {
        "term": "variance",
        "meaning": "How widely values in a dataset differ from the mean. It is calculated as the average of the squared differences between the values and the mean. The standard deviation is often used instead, since it has the same units as the data, while the variance is expressed in units squared."
    },
    {
        "term": "vector",
        "meaning": "A sequence of values, usually of homogeneous type. Vectors are the fundamental data structure in R; a scalar is just a vector with exactly one element."
    },
    {
        "term": "vectorize",
        "meaning": "To write code so that operations are performed on entire vectors, rather than element-by-element within loops."
    },
    {
        "term": "version control system",
        "meaning": "A system for managing changes made to software during its development."
    },
    {
        "term": "vertex shader",
        "meaning": "The [shader][#shader] stage in the rendering pipeline designated towards handling operations on individual vertices in a scene. A vertex shader can be used to calculate properties of a single vertex, such as position and per-vertex lighting. Not to be confused with [fragment shaders][#fragment_shader] which are used to determine the actual colour being rendered to each pixel of the screen."
    },
    {
        "term": "vignette",
        "meaning": "A long-form guide used to provide details of a package beyond the README.md or function documentation."
    },
    {
        "term": "Vim (editor)",
        "meaning": "The default text editor on Unix. Vim is a very powerful text editor, with a steeper learning curve than nano, but that allows the user to execute shell commands and use regular expressions to alter files programmatically."
    },
    {
        "term": "virtual environment",
        "meaning": "In Python, the virtualenv package allows you to create virtual, disposable, Python software environments containing only the packages and versions of packages you want to use for a particular project or task, and to install new packages into the environment without affecting other virtual environments, or the system-wide default environment."
    },
    {
        "term": "virtual machine",
        "meaning": "A program that pretends to be a computer. This may seem a bit redundant, but VMs are quick to create and start up, and changes made inside the virtual machine are contained within that VM so we can install new packages or run a completely different operating system without affecting the underlying computer."
    },
    {
        "term": "Visitor pattern",
        "meaning": "A design pattern in which the operation to be done is taken to each element of a data structure in turn. It is usually implemented by having a generator “visitor” that knows how to reach the structure’s elements, which is given a function or method to call for each in turn, and that carries out the specific operation."
    },
    {
        "term": "walk (a tree)",
        "meaning": "To visit each node in a tree in some order, typically depth-first or breadth-first"
    },
    {
        "term": "while loop",
        "meaning": "A statement in a program that repeats one or more other statements (the loop body) as long as a condition is true."
    },
    {
        "term": "whitespace",
        "meaning": "The space, newline, carriage return, and horizontal and vertical tab characters that take up space but do not create a visible mark. The name comes from their appearance on a printed page in the era of typewriters."
    },
    {
        "term": "wildcard",
        "meaning": "A character expression that can match text, such as the * in *.csv (which matches any filename whose name ends with .csv)."
    },
    {
        "term": "workflow",
        "meaning": "A way of describing work to be done as a set of tasks, typically with dependencies on external inputs or the outputs of other tasks, which can later be executed by a program. An example is a Makefile which can be executed by the make Unix command"
    },
    {
        "term": "XML",
        "meaning": "A set of rules for defining HTML-like tags and using them to format documents (typically data). XML was popular in the early 2000s, but its complexity led many programmers to adopt JSON, instead."
    },
    {
        "term": "YAML",
        "meaning": "Short for “YAML Ain’t Markup Language”, a way to represent nested data using indentation rather than the parentheses and commas of JSON. YAML is often used in configuration files and to define parameters for various flavors of Markdown documents."
    }
]